[
	{
		"title": "BR01 Cyber Skull In Bronze Flirts With The Fascination Of Death",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\n<a href=\"https://thehourmarkers.com/featuring/watches-wonders-2023-bell-ross-complex-technical-marvel-in-a-skeletonised-mechanical-affair-in-the-br05-collection/\">Bell &amp; Ross</a> revived the Skull trends in modern watchmaking in 2009 with the inceptive timepiece offering in the launch of its Skull Collection: BR 01 SKULL.\r\n\r\nA decade later, the Skull reappeared from the manufacture at Bell &amp; Ross once again confirming the prominence that Bell &amp; Ross garners within the contemporary design watches. The ultra-futuristic styling cues highlighted by the faceted styles of this avant-garde model teleport the wearer to a different dimension.\r\n\r\n[caption id=\"attachment_18662\" align=\"alignnone\" width=\"900\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63a5b3530000000000000000_BIG.jpg\"><img class=\"size-full wp-image-18662\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63a5b3530000000000000000_BIG.jpg\" alt=\"The BR01 Cyber Skull boldly commits to the skull character\" width=\"900\" height=\"674\" /></a> The BR01 Cyber Skull boldly commits to the skull character[/caption]\r\n\r\nAt the <a href=\"https://thehourmarkers.com/in-conversation/watches-and-wonders-2023-wrap-up-when-the-world-gets-together-for-some-rapid-fire-and-seriously-fun-discussions/\">Watches and Wonders 2023</a>, Bell &amp; Ross introduced the latest in the series: the Cyber Skull Bronze. This watch is inspired by the appearance of the iconic Cyber Skull only to be alive this time as the bronze construction which makes the 500 pieces of this series watch ever evolving.\r\n\r\nThe sculpted case reminiscent of the angular fuselage of a stealth aircraft along with the imaginative cutting-edge techniques of Bruno Belamich - Artistic Director of Bell &amp; Ross resulted in a modern interpretation of the Cyber Skull in 2020. This watch boasts a complex personality while offering an avant-garde design. The timepiece seconds as an honest tribute to origami, this ancestral Japanese art of folding.\r\n\r\nLaunched at the Watches and Wonders 2023, the new Cyber Skull Bronze takes up the square case in a bronze version. This unique design with this gold-colored skull offers a peak rock and roll look which we could easily imagine on the wrist of a rock star.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A 100% In-House Caliber</strong></span>\r\n\r\n[caption id=\"attachment_18663\" align=\"aligncenter\" width=\"667\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63d0f7ff0000000000000000_BIG.jpg\"><img class=\"size-full wp-image-18663\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63d0f7ff0000000000000000_BIG.jpg\" alt=\"BR-CAL.210 manual winding caliber\" width=\"667\" height=\"900\" /></a> BR-CAL.210 manual winding caliber[/caption]\r\n\r\nThe artistic nuances in the Cyber Skull Bronze are perfectly complemented by the Bell &amp; Ross-developed BR-CAL.210 movement which features an automaton animation activated by the manual winding action. The crown rotation makes the jaw of the skull comes alive leading to an array of expressions for the death personifying skull.\r\n\r\nThe Skull appears floating in the watch case as it is inserted between two sapphire crystal plates. The in-house BR-CAL.210 caliber, almost invisible, is concealed behind the skull. The movement architecture including its plates and bridges follow the skull contour and the spiral balance wheel located at twelve o’clock symbolizes the full-of-life brain of this skull.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Timeline Of The Skull Bronze</strong></span>\r\n\r\n<strong>2015:</strong> The BR 01 SKULL BRONZE is introduced as the first in the “skull” family to adopt a bronze case that acquires a patina over time. This version features a pronounced retro-futuristic style.\r\n\r\n<strong>2016:</strong> The BR 01 SKULL BRONZE TOURBILLON, a unique Haute Horlogerie timepiece with Tourbillon, is destined for the famous Only Watch charity sale.\r\n\r\n<strong>2017:</strong> The BR 01 BURNING SKULL BRONZE is the bronze derivative of the Burning Skull. This model introduced a 3D dimension to Bell &amp; Ross’ “skull”.\r\n\r\n<strong>2023:</strong> Launch of the BR 01 CYBER SKULL BRONZE at the Watches and Wonders.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Defiant In Death And Perpetually Alive</strong></span>\r\n\r\nExpressing a carefree approach to life and encouraging the wearer to live life in full, the BR 01 Cyber Skull Bronze, symbolizes the fragility and brevity of human existence. The <a href=\"https://thehourmarkers.com/featuring/br01-cyber-skull-sapphire-ufo-of-watchmaking/\">Skull</a> family is directly linked to the military and aeronautic world. The skull has been a warrior symbol intended as much to affirm the bravery of magnificent men as to impress their opponents.\r\n\r\n[caption id=\"attachment_18664\" align=\"alignnone\" width=\"900\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63a5b3530000000000000000_BIG-1.jpg\"><img class=\"size-full wp-image-18664\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63a5b3530000000000000000_BIG-1.jpg\" alt=\"The watch features a moving skull jawbone when wound by hand\" width=\"900\" height=\"674\" /></a> The watch features a moving skull jawbone when wound by hand[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Bronze, A Material That Keeps Evolving</strong></span>\r\n\r\nToday, the Cyber Skull reappears in a bronze version. The case, the crown, and the pin buckle adorn this alloy of copper and tin. Bronze is a living alloy that evolves. It acquires a unique patina in contact with each person’s skin. This version is the union of a traditional watchmaking material and an ultra-modern design.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Timepiece Of Character</strong></span>\r\n\r\nThe Skull collection has become an emblematic signature for <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-bell-ross-introducing-the-br-03-92-diver-white-bronze-a-watch-that-suits-the-deepwater-abyss/\">Bell &amp; Ross</a>. The <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-bell-ross-a-chapter-inclusion-for-the-br-03-professional-collection-with-the-gmt-blue/\">Cyber Skull Bronze</a> with avant-garde design is a perfect canvas depicting the brand’s design creativeness as well as watchmaking prowess.\r\n\r\n[caption id=\"attachment_18665\" align=\"aligncenter\" width=\"448\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63d0f7b80000000000000000_BIG.jpg\"><img class=\"size-full wp-image-18665\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/63d0f7b80000000000000000_BIG.jpg\" alt=\"The BR01 Cyber Skull appeals to collectors of Haute Horlogerie timepieces\" width=\"448\" height=\"900\" /></a> The BR01 Cyber Skull appeals to collectors of Haute Horlogerie timepieces[/caption]\r\n\r\nThis watch is guaranteed to cast a bewitching spell on collectors and enthusiasts of the character. The watch is available in a limited edition of 500 pieces.\r\n\r\nA must-have for bikers and heavy metal enthusiasts!"
	},
	{
		"title": "The HANDwerk Series Continues With Kudoke 3 Unveiled At AHCI 2023",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nLast week the entire city of Geneva was brimming with tourbillon and chronograph energy owing to some spectacular launches at <a href=\"https://thehourmarkers.com/in-conversation/in-conversation-with-catherine-renier-ceo-of-jaeger-lecoultre-on-the-secrets-of-the-reverso-1931-cafe-and-more-at-watches-and-wonders-2023/\">Watches And Wonders 2023</a>. But, some subtle launches from brands at AHCI will surely take you by surprise.\r\n\r\nFirst things first. This brand has an explanation for the delay in unveiling the new model. The HANDwerk line's success, combined with<a href=\"https://thehourmarkers.com/featuring/interconnecting-the-british-and-german-watchmaking-kudoke-and-the-limited-edition-present-an-elegant-english-variant-of-time-kudoke-2/\"> KUDOKE</a> 2's 2019 <a href=\"https://thehourmarkers.com/industry-news/the-22nd-annual-grand-prix-dhorlogerie-de-geneve-presenting-the-gphg-2022-winners/\">GPHG</a> victory, has been too much for them to handle. The constant need has tied up all of their resources. In response, they've increased their workforce and broken ground on a brand-new, larger factory.\r\n\r\n[caption id=\"attachment_18743\" align=\"alignnone\" width=\"2048\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/K1_2_3-2048x2048-1.jpg\"><img class=\"size-full wp-image-18743\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/K1_2_3-2048x2048-1.jpg\" alt=\"KUDOKE 1,2 AND 3\" width=\"2048\" height=\"2048\" /></a> KUDOKE 1,2 AND 3[/caption]\r\n\r\nAfter the success of the first two models in the <a href=\"https://thehourmarkers.com/featuring/moritz-grossman-unveils-a-limited-edition-date-turquoise-with-the-royal-art-of-guilloche/\">HANDwerk collection</a>, KUDOKE 1 and KUDOKE 2, as well as numerous variations and limited editions, the third model in this series was unveiled in Geneva, Switzerland, from March 27 to April 2, 2023, as part of the exhibition \"Masters of Horology\" of the Académie Horlogère des Créateurs Indépendants (AHCI). Also, besides KUDOKE 3, what else could it be called?\r\n\r\nLike the first two versions, this watch bears the unmistakable hallmark of the HANDwerk collection. The dial's matte frosted surface and repeated applied elements create a sense of refined simplicity. However, it differs greatly from its forerunners in terms of the dial side. For KUDOKE 3, Stefan Kudoke chose an unusual method of displaying the time after being inspired by vintage English pocket watches in the style of the HANDwerk line.\r\n\r\n[caption id=\"attachment_18744\" align=\"alignnone\" width=\"1282\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/windmills.jpg-1282x1536-1.jpeg\"><img class=\"size-full wp-image-18744\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/windmills.jpg-1282x1536-1.jpeg\" alt=\"Inspirational piece: Joseph Windmills, London, around 1695 (The English Watch, 1585-1970, Terence Camerer Cuss, page 126)\" width=\"1282\" height=\"1536\" /></a> Inspirational piece: Joseph Windmills, London, around 1695<br />(The English Watch, 1585-1970, Terence Camerer Cuss, page 126)[/caption]\r\n\r\nThe large blued steel hand \"classically\" indicates the minutes at the top of the dial ring, while the hour indication is located on a plate divided into three sections at the level of the dial below.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_2102-Large-1.jpeg\"><img class=\"alignnone wp-image-18750 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_2102-Large-1.jpeg\" alt=\"Kudoke 3\" width=\"960\" height=\"1280\" /></a>\r\n\r\nThe hour is shown by a hand that runs between the two dials and has three arms of varying lengths. When one hand's arm reaches the final hour marker, the next longer or shorter arm will appear at the first marker of the following hour. Next, the current hand arm displays the numbers 2, 6, and 10 twice, each time at a different size. Unique in its simplicity.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_2108-Large.jpeg\"><img class=\"alignnone size-full wp-image-18748\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_2108-Large.jpeg\" alt=\"Koduke 3\" width=\"960\" height=\"1280\" /></a>\r\n\r\nBut the devil is in the details, as is so often the case in life. As such, the HANDwerk collection's infinity symbol—an infinity sign—can be found in this prototype as well. In addition to being printed on the minute ring at the position of 60, which bridges the end and beginning of each hour, it is also integrated into the tip of the minute hand. The three-legged hour hand inverts this sign. These \"finite\" hands would go well with an infinity symbol, much like <a href=\"https://thehourmarkers.com/industry-news/hktdc-hong-kong-watch-clock-fair-and-salon-de-te-open-in-september/\">Yin and Yang</a>. context of the entire world.\r\n\r\nThe gently curving wave shape of the hour plate on the silver-plated dial below is mirrored on the rhodinized upper dial with the balancing logo plate. Minute indicators 10, 20, 40, and 50 are represented by four screws that secure them to the lower dial alongside the minute ring. The dial of the watch has impressive depth thanks to the various levels and tasteful colouring. Light can be played with in interesting ways thanks to the diamond-cut edges on the hour plate, logo plate, and minute chapter ring.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Kaliber1_engraved_Image-1536x1151-1.jpg\"><img class=\"alignnone size-full wp-image-18749\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Kaliber1_engraved_Image-1536x1151-1.jpg\" alt=\"Kaliber1_engraved_Image-1536x1151\" width=\"1536\" height=\"1151\" /></a>\r\n\r\nThe heart of this classic yet extravagant watch, KALIBER 1, is exposed through the sapphire crystal case back. The understated 39 mm stainless steel case with a classic onion crown and 10.3 mm case height provides an appropriate setting for this watch.\r\n\r\n<em>Priced at EUR 9350 excluding VAT</em>\r\n\r\n<strong>Technical Specifications:</strong>\r\n\r\n<strong>Case:</strong>\r\n<ul>\r\n \t<li>W: 39mm, H: 10.3 mm</li>\r\n \t<li>Polished stainless steel / 18 ct Rose Gold (5N) on special order</li>\r\n \t<li>Fluted onion crown</li>\r\n \t<li>Convex sapphire crystal with anti-reflective coating</li>\r\n \t<li>Sapphire crystal exhibition caseback</li>\r\n \t<li>5 ATM/50m water resistance</li>\r\n</ul>\r\n<strong>Dial &amp; Hands:</strong>\r\n<ul>\r\n \t<li>Frosted two-part dial, silvered/ rhodinized, with rhodinized chapter ring on top dial and plate to indicate hours in three sections on dial below</li>\r\n \t<li>Flame tempered blued steel hands, minute hand with infinity symbol, three-arm hour hand</li>\r\n</ul>\r\n<strong>Movement:</strong>\r\n<ul>\r\n \t<li>In-house Kaliber 1 manual winding</li>\r\n \t<li>W: 30mm, H: 4.3 mm</li>\r\n \t<li>18 jewels</li>\r\n \t<li>28,800 vib/h (4Hz)</li>\r\n \t<li>46 hours power reserve</li>\r\n \t<li>Frosted hand-finish of wheel bridge</li>\r\n \t<li>Hand-engraved balance cock with infinity symbol</li>\r\n</ul>\r\n<strong>Strap &amp; Buckle:</strong>\r\n\r\nLeather or Alcantara strap\r\nStainless steel pin buckle/ 18 ct Rose Gold on special order/ electively folding clasp stainless steel"
	},
	{
		"title": "TAG Heuer Showcases Innovation With The First-Colored Carrera Plasma 36mm",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nBringing new shapes, novel textures, and unique hues to the gem set wonders of the watch world, <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-tag-heuer-the-first-glassbox-carrera-chronograph-tourbillon/\">TAG Heuer</a> has unveiled its latest chapter of the breakthrough <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2022-tag-heuer-carrera-plasma/\">Diamant d’Avant-Garde</a> technology with the launch of the first colored TAG Heuer Carrera Plasma 36 mm at Watches and Wonders 2023.\r\n\r\nMarking the inception of the latest innovation in the Chemical Vapor Deposition (CVD) technique for giving birth to lab-grown diamonds, TAG Heuer has been able to achieve amazing colors for the stones which can be cherished in beguiling bright pink hues on the latest timepiece.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The First Colored Lab-Grown Diamonds In A TAG Heuer Watch</strong></span>\r\n\r\nThe TAG Heuer Carrera Plasma collection embodies the future-forward approach driving Maison’s advancements in high-horology. It blends the revolutionary Diamant d'Avant-garde technology with a unique and unconventional aesthetic. The TAG Heuer Carrera Plasma 36 mm goes beyond the norm and pushes the boundaries of traditional horological design.\r\n\r\nThe latest watch release highlights a blend of white and pink lab-grown diamonds, with plans to utilize colored lab-grown diamonds more extensively in upcoming high-end watch models even predicted to be available in a rainbow spectrum in the future. This unveiling follows the presentation of the TAG Heuer Carrera Plasma Diamant d'Avant-Garde \"2.0\", which integrates lab-grown diamonds in unique and artistic shapes on the aluminum bezel and bracelet. The latest timepiece features 1.4 carats of colored Diamant d’Avant-Garde.\r\n\r\n[caption id=\"attachment_18897\" align=\"alignnone\" width=\"1831\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-2-e1680957141203.png\"><img class=\"wp-image-18897 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-2-e1680957141203.png\" alt=\"TAG Heuer Carrera Plasma\" width=\"1831\" height=\"960\" /></a> The crown diamond is a first-of-its-kind singular 1.3-carat pink lab-grown diamond[/caption]\r\n\r\nThis innovation marks the continuation of the remarkable <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-tag-heuer-carrera-plasma-unveiled-with-lab-grown-diamonds-and-aluminium-bezel/\">TAG Heuer</a> journey, as its 163-year history merges with innovative, cutting-edge advancements.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Reinstating The Lost Allure For Gem Setting On Watches With An Innovation Packed Timepiece</strong></span>\r\n\r\nAs expressed beautifully by <a href=\"https://thehourmarkers.com/featuring/tag-heuer-formula-1-x-mario-kart-two-limited-edition-timepieces-leading-to-victory/\">Frédéric Arnault</a> at the watch’s launch at Watches and Wonders “With the new TAG Heuer Carrera Plasma Diamant d’Avant-Garde, we intend to expand the new high-end innovative segment with this first colored lab-grown diamond piece. We are proud at TAG Heuer, that we are yet again able to introduce a true innovation with colored Diamant d’Avant-Garde to be used on luxury timepieces.”\r\n\r\n[caption id=\"attachment_18898\" align=\"alignnone\" width=\"2160\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/02-WBN2340BC0005_FOCUS_16-9.jpeg\"><img class=\"size-full wp-image-18898\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/02-WBN2340BC0005_FOCUS_16-9.jpeg\" alt=\"The first colored TAG Heuer Carrera Plasma highlights the potential of lab-grown diamonds\" width=\"2160\" height=\"1215\" /></a> The first colored TAG Heuer Carrera Plasma highlights the potential of lab-grown diamonds[/caption]\r\n\r\nSupplementing Frédéric Arnault’s remarks, the Director of the TAG Heuer Institute Emmanuel Dupas says, “A diamond, be it natural or lab-grown, consists of a regular arrangement of carbon atoms. A perfect diamond, color D and flawless, has almost no defect in this arrangement and is completely colorless. In order to obtain a colored diamond, one needs to introduce some disorder into this perfect arrangement, in a controlled way. This disorder can be due to the addition of atoms of different elements or to the presence of defects: for example, missing carbon atoms. The CVD process offers the opportunity to introduce these defects during the growth process, in a well-controlled environment, without the need for any post-processing. This way, the diamond is colored all the way through and homogeneously. Very specific know-how – such as it is owned by one of our partners ‘Proud’ – is required to control this process and to be able to reproduce the same color, batch after batch.”\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Stand-Out Timepiece Serving A Blend Of Avant-Garde Design And Mechanical Perfection</strong></span>\r\n\r\nThe newly introduced TAG Heuer Plasma Diamant d'Avant-Garde timepiece is now available in white gold with a 36mm case, representing the newly refined and revisited model of the TAG Heuer Carrera Date launched at Watches and Wonders 2023. The flange, located beneath the crystal, is now azured, adding to the watch's unique look. The watch's crown diamond is a singular 1.3-carat pink lab-grown diamond, which complements the newly designed Diamant d'Avant-Garde shield on the polycrystalline dial, creating breathtaking reflections and light effects through the use of CVD technology.\r\n\r\n[caption id=\"attachment_18899\" align=\"alignnone\" width=\"2048\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-7-scaled.jpg\"><img class=\"size-full wp-image-18899\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-7-scaled.jpg\" alt=\"The watch features a 36mm white gold case with a 2.9-carat dial design\" width=\"2048\" height=\"2560\" /></a> The watch features a 36mm white gold case with a 2.9-carat dial design[/caption]\r\n\r\nThe 2.9-carat dial design features 12 white gold indexes set with white lab-grown diamonds, and the hours and minutes hands are \"skeletonized”. Above them, a special shield-shaped pink diamond sits just below the signature <a href=\"https://thehourmarkers.com/featuring/tag-heuer-carrera-x-porsche-limited-edition-where-a-shared-passion-meets-history/\">Carrera</a> dial logo. This one-of-a-kind, three-handed timepiece weighs a total of 4.8 carats and comes paired with a black alligator strap with a white gold pin buckle.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Cutting-Edge Technology Meets Stunning Visual Aesthetics</strong></span>\r\n\r\nThe TAG Heuer Calibre 7 Automatic powering this dazzling timepiece can be viewed through the watch's sapphire exhibition case back. As the brand celebrates the 60th anniversary of the iconic TAG Heuer Carrera, they continue to innovate with their Diamant d'Avant-Garde pieces, showcasing a continued passion and commitment to TAG Heuer's pioneering spirit and DNA.\r\n\r\nThe TAG Heuer Carrera Plasma Diamant d'Avant-Garde 36mm unveiled at Watches and Wonders 2023 is the first prototype of its kind, with a limited number of pieces available for purchase at the end of 2023 in TAG Heuer stores worldwide. The brand will release fully colored models in the future.\r\n\r\nThe timepiece will be priced at INR 8,370,000."
	},
	{
		"title": "The Ressence Type 8 S In An Elegant Sage Green Dial",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nIn true spirit of the watchmaking ethos at <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-ressence-the-type-1-round-explores-essential-shapes-at-a-higher-horological-expression/\">Ressence</a>, its latest creation revealed at the <a href=\"https://thehourmarkers.com/in-conversation/watches-and-wonders-2023-wrap-up-when-the-world-gets-together-for-some-rapid-fire-and-seriously-fun-discussions/\">Watches and Wonders 2023</a> continues to explore the novel timekeeping expression in delectable hues. This time, the TYPE 8 gets a Sage Green dial to expand the colour palette of this purest expression of design from Ressence.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_1399-scaled.jpg\"><img class=\"alignnone wp-image-19351 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_1399-scaled.jpg\" alt=\"Ressence Type 8 S\" width=\"1920\" height=\"2560\" /></a>\r\n\r\nThe timepiece with its subtle and elegant green hues fosters an aesthetic which instils a sense of optimism and serenity to the lightweight all-titanium timepiece launched at Watches and Wonders 2023. Complementing the existing TYPE 8 Cobalt Blue, this new color creation further refines the sixth and latest type of the <a href=\"https://thehourmarkers.com/featuring/seize-the-moment-of-joy-with-ressences-type-1-rev-grail-watch/\">Ressence</a> family collection.\r\n\r\n[caption id=\"attachment_18916\" align=\"alignnone\" width=\"2560\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Type-8S-on-Grey-Leather-final-original-scaled.jpeg\"><img class=\"size-full wp-image-18916\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Type-8S-on-Grey-Leather-final-original-scaled.jpeg\" alt=\"The Ressence Type 8 S is an epitome of minimalistic architecture\" width=\"2560\" height=\"2560\" /></a> The Ressence Type 8 S is an epitome of minimalistic architecture[/caption]\r\n\r\nThe watch dominates in ergonomic comfort and its deceptively simple aesthetics highlight the hours and minutes around the dial. The timepiece forms the entry level range of the brand with its price-point.\r\n\r\n“The TYPE 8 is the purest, most essential of all Ressence experiences. You cannot possibly subtract anything more from it. To maximise legibility, its dial has been reduced to its most viable minimum”, says Benoît Mintiens, Founder of Ressence.\r\n\r\nFurther adding to it, he states that “Colour is a part of our universal human language that reaches beyond time and culture. Colour triggers our emotions and affects how we experience the world around us. Awakening senses is key to Ressence, and colour certainly plays a part in this endeavour.”\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A complex yet simple aesthetic</strong></span>\r\n\r\nWhat first seems a simple display of hours and minutes with no text or numbers on the dial is actually a complicated system of the revolutionary Ressence<a href=\"https://thehourmarkers.com/featuring/ressence-drops-the-type-3bbb-black-black-black/\"> Orbital Convex System</a> (ROCS) display, whereby the dial itself comprises rotating discs set into the same plane.\r\n\r\nEnhancing the low light legibility, the hands, the hour and minute scales feature SuperLuminova® application. Resonating the true ethos of all Ressence watches, the dial of the Type 8 launched at Watches and Wonders presents a timekeeping expression in a rare notion as the main dial, a domed piece of titanium, rotates to indicate the minutes. Set within it on the same plane, a smaller dial rotates to mark the hours. Easily legible and comprehendible, the dial which is ever-changing with the passage of time presents an intuitive at-a-glance display.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Undeniably discreet</strong></span>\r\n\r\nThe slim and sleek finish of the TYPE 8 makes it the lightest of all Ressence watches. The watch, including its strap weighs a mere 42 grams. The case is constructed from feather-light grade five Titanium and fits ever so comfortably on the wrist.\r\n\r\n[caption id=\"attachment_18917\" align=\"alignnone\" width=\"1360\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Flat-LD-original.jpeg\"><img class=\"size-full wp-image-18917\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Flat-LD-original.jpeg\" alt=\"The Type 8 S is the lightest Ressence watch\" width=\"1360\" height=\"886\" /></a> The Type 8 S is the lightest Ressence watch[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Ergonomic in utility</strong></span>\r\n\r\nWearability dominates with Ressence’s previous designs and further cementing the brand’s founding ethos of ergonomic utility is the TYPE 8 with an interrupted case aesthetic signified by the absence of the traditional crown to carve an ambidextrous design. To set the time, the <a href=\"https://thehourmarkers.com/in-my-opinion/titanium-the-metal-that-ruled-the-roost-at-watches-wonders-2022/\">Titanium</a> case back must be rotated and this action doubles as winding the movement as well.\r\n\r\n[caption id=\"attachment_18918\" align=\"alignnone\" width=\"900\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Case-back-detail-LD-original.jpeg\"><img class=\"size-full wp-image-18918\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Case-back-detail-LD-original.jpeg\" alt=\"The case-back on Ressence Type 8 S sets time and winds the movement\" width=\"900\" height=\"594\" /></a> The case-back on Ressence Type 8 S sets time and winds the movement[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Strengthening the pursuit of mechanical perfection</strong></span>\r\n\r\nA modified and reinforced version of the traditional mechanical automatic movement TA calibre 2892/2 with a 36-hour power reserve powers the TYPE 8.\r\n\r\nIt is the ROCS (Ressence Orbital Convex System) which highlights the timepiece’s mechanical ingenuity. This patented mechanism features a rotating dial and the module has been designed using a series of jewel ball bearings to ensure long-lasting, oil-free running. The ROCS module - which in the TYPE 8 is designated ROCS 8 - is just one of Ressence’s ground-breaking innovations that demonstrate the brand’s striving for perpetual excellence in the movement manufacture department ushering in a new wave of interest for traditional mechanical watchmaking.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Case-back-LD-original.jpeg\"><img class=\"alignnone size-full wp-image-18919\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Ressence-Type-8-S-Case-back-LD-original.jpeg\" alt=\"Ressence Type 8 S - Case back - LD (original)\" width=\"1368\" height=\"906\" /></a>The TYPE 8 will be available worldwide from early May 2023, via Ressence’s official retailers network, and visible at Watches &amp; Wonders in Geneva from March 27th to April 5th 2023.\r\n\r\n<span style=\"font-size: 18pt;\"><strong><a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_1400-scaled.jpg\"><img class=\"alignnone size-full wp-image-19352\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/IMG_1400-scaled.jpg\" alt=\"Ressence Type 8 S\" width=\"1920\" height=\"2560\" /></a>Technical Specifications</strong></span>\r\n\r\nNAME : TYPE 8S (Sage Green)\r\nFunctions\r\n• Hours\r\n• Minutes\r\nMovement\r\n• Patented ROCS 8 - Ressence Orbital Convex System - driven by the minute axle of a customised and\r\nreinforced 2892/2 base calibre\r\n• Self-winding\r\n• 36 hours power reserve\r\n• 28,800 vibrations per hour\r\n• 20 gears\r\n• 31 jewels\r\n• 4 ball bearings\r\nDial\r\n• Metallic Matt Sage Green or Cobalt Blue grade 5 titanium convex dial (75mm radius) running on a jewel\r\nball bearing with eccentric satellites rolling on jewel ball-bearings inclined at 9,75° (hours)\r\n• Engraved indications filled with 100% SuperLuminova® grade A\r\nCase\r\n• 42,9 mm (diameter) x 11 mm (thickness)\r\n• Polished/satinated Grade 5 titanium\r\n• Sandwich architecture\r\n• Domed sapphire crystals\r\n• 1 ATM splash-resistance\r\n• Manual winding over 12° and set-up via case-back (crownless). Rotating two directions.\r\nBuckle &amp; Strap\r\n• Polished Ardillon Buckle in grade 5 Titanium\r\n• Grey leather strap (20/20mm)\r\nMeirbrug 1, 2000 Antwerp, Belgium - ressencewatches.com\r\nTotal Components\r\n• 188\r\nWeight\r\n• 42 grams including strap (33 g ex-strap)\r\nPrice\r\n• CHF12,500 (excluding taxes)"
	},
	{
		"title": "A New Chapter For Bulgari’s Octo Roma Collection With A Chronograph Debut",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nThe <a href=\"https://thehourmarkers.com/featuring/the-modern-legend-the-record-breaking-bulgari-octo-finissimo-has-already-disrupted-the-industry-8-times-in-less-than-10-years/\">Bulgari Octo</a>, which debuted in 2012, has had a significant influence on the watchmaking industry in the past decade. It has become synonymous with Bulgari's uncanny ability to renew and reinvigorate its signature aesthetic and a profoundly innovative and powerful Italian-style design that enriches the art of Swiss watchmaking.\r\n\r\nThe new Octo Roma collection is highly adaptable, stylish, and elegant. A self-assured, well-dressed person would love this watch because of its variety of options, from a beautiful automatic watch to a stunning chronograph to a mesmerizing tourbillon. The Octo Roma is emblematic of Bulgari's ability to innovate and its contribution to <a href=\"https://thehourmarkers.com/featuring/genus-swiss-watch-making-at-its-finest/\">Swiss watchmaking</a> in the company's signature Italian style, with its strikingly unique and daring design.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/sketch_20230314_09033154.jpg\"><img class=\"alignnone size-full wp-image-18966\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/sketch_20230314_09033154.jpg\" alt=\"The Bulgari Octo\" width=\"900\" height=\"1291\" /></a>The octagonal shape has a long history in Italian architecture, appearing in famous buildings like the Pantheon and in the works of Leonardo da Vinci; the vaults of the Basilica of Maxentius, constructed in the fourth century on one of Rome's most important architectural sites, are particularly notable for their eight-sided geometry. This design principle is also prominent in Bulgari's historical jewelry from the Monete collection, further cementing the company's ties to the Roman Empire.\r\n\r\nThe sumptuous volumes and chains of the pendants from the 1970s also harken back to this aesthetic, as do the colorful geometries that come to life in the iconic Parentesi modular collection. And it has become the signature look for the <a href=\"https://thehourmarkers.com/featuring/the-modern-legend-the-record-breaking-bulgari-octo-finissimo-has-already-disrupted-the-industry-8-times-in-less-than-10-years/\">Octo Finissimo</a> line from Bulgari. Octo Roma embodies the chic sophistication that has made Bulgari a household name in the world of high-end timepieces by drawing from both antiquity and the present day. Octo Roma stands apart by fusing heritage, architecture, and fine watchmaking through its extreme sophistication of varying finishes with circular and octagonal shapes playing off each other.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Octo-Roma-Auto_004_craft-skt.jpg\"><img class=\"alignnone size-full wp-image-18967\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Octo-Roma-Auto_004_craft-skt.jpg\" alt=\"Octo Roma\" width=\"1200\" height=\"900\" /></a>\r\n\r\nThe Octo Roma's structure is similar to that of the Octo Finissimo, but its softer angles and lines give it a more refined air. Since the lugs are narrower than those of the Finissimo, the bracelet is less noticeable when worn.\r\n\r\nThe time-and-date model of the Octo Roma is otherwise identical to its predecessor in every respect, down to the 41mm case diameter, the bracelet's attractive combination of polished and brushed surfaces, and the quick-release system that allows you to switch from the bracelet to the rubber strap that comes standard. The watch is powered by the same <a href=\"https://thehourmarkers.com/in-my-opinion/behind-big-names-and-under-the-radar-great-underdogs-of-the-watch-world/\">Bulgari caliber BVL 191</a>. Both models boast increased water resistance to a maximum of 100 meters, up from 50 meters, and a screw-down crown.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/103739-103471_001_cre_V2_w.jpg\"><img class=\"alignnone size-full wp-image-18968\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/103739-103471_001_cre_V2_w.jpg\" alt=\"Bulgari Octo Roma Chronograph\" width=\"1200\" height=\"1501\" /></a>\r\n\r\nThe Octo Roma Chronograph is a notable addition to the collection, and it stands out thanks to its sleek dial and easily readable blue or black display. It has a chronograph function that allows for the most accurate tracking of time elapsed thanks to its central seconds hand, 30-minute counter, and 12-hour counter. The date window can be read easily at any time because it is located between 4 and 5 o'clock, and the three sunburst counters can be read easily at 3, 6, and 9 o'clock. The automatic winding mechanical heart of the Calibre BVL 399 was built right here in Switzerland. The mechanism winds itself with the wearer's wrist motion and operates at a frequency of 28,800 vibrations per hour, making it highly accurate and reliable. The sapphire case back reveals the meticulous construction and ornate decoration of the movement.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Octo-Roma-Auto_001_craft-2.jpg\"><img class=\"alignnone size-full wp-image-18969\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Octo-Roma-Auto_001_craft-2.jpg\" alt=\"Octo-Roma-Auto_001_craft-2\" width=\"1200\" height=\"900\" /></a>\r\n\r\nIn a similar vein, the two pushers of the chronograph version have been meticulously integrated into the case, continuing onwards from the lugs. By adhering to the unchanging principles of Roman architecture, form, function, design, and ergonomics are brought together to form a unified and harmonious whole. This 42mm timepiece is ideal for the discriminating buyer because it satisfies the tastes of both purists and trendsetters with its harmonious blend of classic craftsmanship and daring, modern design.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Automatic_w.jpg\"><img class=\"alignnone size-full wp-image-18970\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Automatic_w.jpg\" alt=\"Bulgari-2023_Octo-Roma-Automatic_w\" width=\"1800\" height=\"1440\" /></a>\r\n\r\nThe new Octo Roma models have an interchangeable wristband, giving the wearer even more options. The interchangeability system is so important to Bulgari that the company's watchmakers took extra precautions to ensure seamless integration with the case. As a result, it is installed between the lugs on the back of the case as a pusher that is part of the overall structure.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/103471_002_cre_w.jpg\"><img class=\"alignnone size-full wp-image-18971\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/103471_002_cre_w.jpg\" alt=\"Octo Roma\" width=\"1200\" height=\"1500\" /></a>\r\n\r\nThe system is particularly safe, and it only takes a few seconds and a click to switch out the strap. You can choose between a stainless steel bracelet and a rubber strap, both of which will be delivered by Bulgari at the time of purchase. You can buy replacement straps in a variety of colors and materials, including rubber and alligator leather. The new Octo Roma, a flexible and customizable timepiece, was designed to accommodate a wide range of personal tastes and preferences, which is why it comes in a rainbow of colors and textures.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Auto-White_103738_001_cre_ww.jpg\"><img class=\"alignnone size-full wp-image-18972\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Auto-White_103738_001_cre_ww.jpg\" alt=\"Bulgari-2023_Octo-Roma-Auto-White_103738_001_cre_ww\" width=\"1200\" height=\"1498\" /></a>\r\n\r\nAdding some much-needed texture to the otherwise smooth dials of these new time-and-date and chronograph models is a Clous de Paris pattern. With the time-and-date Octo Roma, Bulgari offers a choice of blue, anthracite, or white dials, while the chronograph is available in either black or blue.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Auto-Anthracite_103740_ww.jpg\"><img class=\"alignnone size-full wp-image-18973\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Bulgari-2023_Octo-Roma-Auto-Anthracite_103740_ww.jpg\" alt=\"Bulgari-2023_Octo-Roma-Auto-Anthracite_103740_ww\" width=\"1200\" height=\"1500\" /></a>\r\n\r\nWith these new revisions, the Bulgari Octo Roma hits the sweet spot in the sub- $10,000 price bracket occupied by the sporty watches and classics like <a href=\"https://thehourmarkers.com/featuring/rolex-deepsea-challenge-the-hour-markers/\">Rolex Submariner</a>, Omega, and more. Of course, everyone has their own preferences, but with these updates, Bulgari has made the Octo Roma competitive again."
	},
	{
		"title": "THM Suggests: Top 5 High Jewelry Pendant Watches To Elevate Your Ensemble",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nPeople are moving away from the conventional wristwatch in favor of more fashionable timepieces that do double duty by keeping you on time while also complementing your ensemble. Wearing a watch as a pendant around your neck is another great way to draw attention to your ensemble while adding a functional element.\r\n\r\nWatches And Wonders 2023, also saw several new trends and the one that stood out for us was luxury pendant watches! Brands like Chanel, Jaeger-LeCoultre, and Van Cleef &amp; Arpels all released pendant watches in the style of the Art Deco period that could also be worn as necklaces. Here are our top 5 picks for luxury pendant watches of the year!\r\n\r\n<span style=\"font-size: 18pt;\"><strong>1. Jaeger-Lecoultre Reverso Secret Necklace</strong></span>\r\n\r\nThe <a href=\"https://thehourmarkers.com/featuring/jaeger-lecoultre-the-reverso-secret-necklace/\">Reverso Secret Necklace</a>, unveiled this year by the Maison, is a magnificent piece of High Jewellery that exemplifies their dedication to feminine expressions of fine watchmaking. The Manufacturer has taken the 20th-century design classic Reverso and reimagined it as a long necklace with grace and exquisite femininity for this season.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Reverso-Secret-Necklace-1.jpg\"><img class=\"alignnone size-full wp-image-19026\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Reverso-Secret-Necklace-1.jpg\" alt=\"Reverso-Secret-Necklace-1\" width=\"728\" height=\"728\" /></a>\r\n\r\nThe richly gem-set Reverso is suspended from a supple chain of intricate diamond-set links and polished onyx beads, a modern take on the original black textile bracelet seen on Reverso models of the 1930s. This chic new way to wear a watch is adorned with two pendants of polished onyx charms.\r\n\r\nHowever, herein lies the key. The dial of the Reverso Secret Necklace is concealed beneath a gem-set cover until you want to check the time. The swiveling case of the Reverso is an innovative take on this concept, as it hides the time when the watch is turned over.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Reverso-Secret-Necklace-2.jpg\"><img class=\"alignnone size-full wp-image-19027\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Reverso-Secret-Necklace-2.jpg\" alt=\"Reverso-Secret-Necklace-2\" width=\"1440\" height=\"700\" /></a>\r\n\r\nThe Reverso Secret Necklace, which takes its design cues from Art Deco, is a stunning necklace—until you flip it over, that is. The time is displayed on the dial in what looks like an inverted position so that it can be easily read when the wearer lifts the watch to their face.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>2. Van Cleef &amp; Arpels Perlée Secret Pendant Watch</strong></span>\r\n\r\nThere is a wide variety of Sautoir watches available at <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-van-cleef-arpels-secrets-and-precious-stone/\">Van Cleef &amp; Arpels</a>, from elaborate high jewelry pieces to more casual fine jewelry pieces like these new Perlée designs. They look great on their own or layered with other necklaces like the Alhambra in 10 or 20 motifs when worn on a sleek long chain.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Van-Cleef-Arpels-2023.jpg\"><img class=\"alignnone size-full wp-image-19028\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Van-Cleef-Arpels-2023.jpg\" alt=\"Van-Cleef-Arpels-2023\" width=\"1041\" height=\"1080\" /></a>\r\n\r\nThe Perlée Secret Pendant Watch now comes with decorative stone dial covers to complement its already available yellow gold case set with your choice of emeralds, rubies, or blue sapphires. The Maison claims that you won't find these particular kinds of stone in any of their other collections or product lines.\r\n\r\n<strong><span style=\"font-size: 18pt;\">3. Piaget High Jewellery Sautoir Watch</span></strong>\r\n\r\nWith the release of two new high-jewelry sautoir watches this year, <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-piaget-the-aura-watch-dressed-in-midnight-blue-sapphires/\">Piaget</a> has reclaimed its position as the market leader in this category. The original Swinging Sautoir, which was inspired by a design from 1969, was made of gold and featured a gold dial engraved with Piaget's signature Palace décor, as well as handcrafted gold chains, braided gold links, gold tassels studded with closed-set round diamonds, and a swinging mechanism.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/piaget-high-jewellery-sautoir-watch.jpg\"><img class=\"alignnone size-full wp-image-19029\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/piaget-high-jewellery-sautoir-watch.jpg\" alt=\"piaget high jewellery sautoir watch\" width=\"680\" height=\"1020\" /></a>\r\n\r\nHand-twisted gold begins with a single strand of wire, which is coiled around a mandrel and then individually twisted and shaped into smooth, uniform links. Each chain is completely unique, and the entire process takes at least 130 hours. The dial is Piaget's signature oval shape, a design element introduced in the 1960s, and is paired with an oval cabochon Zambian emerald that weighs 25.38 carats.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>4. Chanel Mademoiselle Privé Lion</strong></span>\r\n\r\n<a href=\"https://thehourmarkers.com/featuring/watches-wonders-2023-all-you-need-to-know/\">Chanel</a> is known for its innovative approach to timekeeping, which includes concealing tiny dials in jewelry such as rings, brooches, and necklaces. The lion, which is associated with Mademoiselle Chanel's star sign of Leo, is the inspiration for this year's Lion Sautoir. Here, the classical codes of the Maison are espoused by a delicate gold, diamond, and facetted onyx chain that draws attention to a medallion of black onyx featuring a gold sculpted lion head paved in diamonds.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/chanel.jpg\"><img class=\"alignnone size-full wp-image-19030\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/chanel.jpg\" alt=\"chanel\" width=\"680\" height=\"900\" /></a>\r\n\r\nTurning the medallion reveals another dial made of polished black onyx and set with a diamond circlet. Braided yellow gold forms a border around a circle of softly facetted onyx and a single brilliant diamond at the back.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>5. Van Cleef &amp; Arpels Alhambra Secret Pendant Watch</strong></span>\r\n\r\nThe Alhambra® motif, designed by <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-van-cleef-arpels-the-lady-feerie-watch-reimagined-in-new-hues/\">Van Cleef &amp; Arpels</a> in 1968, has endured as a universal sign of good fortune. This watch line pays homage to a wide variety of precious materials, colors, and cuts that pair well with Alhambra's jewelry designs.\r\n\r\nMother-of-pearl is a treasured material at the Maison, and it is formed naturally in some shells. It shines brightly, lending a sense of femininity, softness, and protection to jewelry designs. Mother-of-pearl is a signature design element for Van Cleef &amp; Arpels, most notably seen in the Alhambra®, Deux Papillons, and Rose de NoelTM jewelry collections.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-2.png\"><img class=\"alignnone size-full wp-image-19031\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-2.png\" alt=\"Van Cleef &amp; Arpels Alhambra Secret Pendant Watch\" width=\"1600\" height=\"1600\" /></a>Diamond is derived from the Greek word adamas, which means \"indomitable,\" which is an apt descriptor for this extraordinary mineral. Solitaires, as well as pieces from the Snowflake and Cheval collections, are just a few examples of the stunning jewelry that can be made using this extraordinary stone and the High Jewelry expertise of Van Cleef &amp; Arpels. Timepieces from the Maison's Cadenas® collection aren't the only ones adorned with diamonds, though.\r\n\r\nSautoir watches are highly distinctive and innovative, and they strongly evoke jewelry and watches from the 1960s. They perfectly captured the spirit of the decade, when women were beginning to achieve equality and take charge of their own lives. It was also a very modern time. Instead of the traditional idea of luxury, in which all jewelry must match and be extremely ornate, sautoir watches combine practicality and elegance. Are you ready to wear these and rock the 60s style with these luxury pendant watches?"
	},
	{
		"title": "The MB&F X L’Epee Tripod: A Strange Animal Joins The Trilogy Of Robocreatures",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nSusan Vreeland, an American writer, once famously said, \"Art begets art.\" This is especially true of TriPod, the 13th time <a href=\"https://thehourmarkers.com/featuring/the-mbf-x-lepee-1839-t-rex-a-walking-dinosaur-on-your-desk/\">MB&amp;F</a> has worked with <a href=\"https://thehourmarkers.com/featuring/golden-boy/\">L'Epée 1839</a>, the premier clockmaker in Switzerland.\r\n\r\nThe minimalist clock face of TriPod hangs between three slender \"legs\" in the shape of insects. It's the second in a trilogy of MB&amp;F's half-animal, half-robot Robocreatures, following the mighty T-Rex. The mechanical creature known as TriPod gets its name from the three components that make up its design: its three legs, its three insect-eye spheres, and its three-movement levels. Additionally, TriPod is the middle clock in a set of three.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_LIVESHOT_RED_HRES_CMYK.jpg\"><img class=\"alignnone size-full wp-image-19123\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_LIVESHOT_RED_HRES_CMYK.jpg\" alt=\"Tripod_LIVESHOT_RED_HRES_CMYK\" width=\"1440\" height=\"960\" /></a>\r\n\r\n\"In the same way that H.R. Giger created his Alien universe, we're creating our own world of creatures. This strange animal wasn’t even my idea,\" is how MB&amp;F founder <a href=\"https://thehourmarkers.com/in-conversation/marking-the-hours-with-maximilian-busser-on-the-world-of-independent-watchmaking-and-the-story-behind-his-co-creations/\">Maximilian Büsser</a> describes Robocreatures.\r\n\r\nRobocreatures have the potential to serve as time capsules, preserving \"life\" from the distant past in fossil form. Maximilian Maertens of Berlin, L'Épée CEO Arnaud Nicolas, and Büsser usher us into a horological post-modern prehistoric era with their TriPod.\r\n\r\nTriPod has three fine legs that hold up a bright body, three glass spheres that look like insect eyes, and a clock face that rotates once every 36 hours and displays three different time zones. The dial conceals a L'Épée 1839 movement consisting of 182 parts and a vertical balance beating at a more sedate than modern 2.5Hz (18,000vph).\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_CLOSE-UP_RED_HRE_CMYK.jpg\"><img class=\"alignnone size-full wp-image-19124\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_CLOSE-UP_RED_HRE_CMYK.jpg\" alt=\"Tripod_CLOSE-UP_RED_HRE_CMYK\" width=\"1080\" height=\"1440\" /></a>\r\n\r\nThe time and winding are controlled by a key, and the eight-day power reserve is a nice bonus. TriPod's time display relies on a rotating disc dial, which the user must look down at to read. However, in order to read the time on this clock, the observer must engage in a little Man vs. Machine conflict: the clock's three optical spheres serve to magnify the time and make them legible.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Where did the inspiration come from?</strong></span>\r\n\r\nMaximilian Maertens, a young designer who interned at MB&amp;F, served as the project's creative incubator. Since Maertens's earliest cinematic memory is of Jurassic Park (1993), it stands to reason that this film had a profound impact on him. It has been a gift that keeps on giving that Maertens' inspiration from his childhood memory was realized in MB&amp;F's T-Rex, the first clock in the Robocreature trilogy. This is fitting since the whole point of these mechanical masterpieces by <a href=\"https://thehourmarkers.com/in-my-opinion/the-mbf-lepee-1839-octopod-a-clock-inspired-by-a-world-underwater/\">MB&amp;F</a> is to inspire kids to become artists.\r\n\r\nMaertens imagined a backstory for T-Rex to help guide his design process, allowing him to strike a balance between mechanical and organic visual elements. MB&amp;F's previous works featured similar elements, such as a spaceship's pilot coming across uncharted planets. Maertens's love of Jurassic Park sparked the development of a new story that would become the backbone of his Robocreature trilogy.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_drawing-1_HRES_CMYK.jpg\"><img class=\"alignnone size-full wp-image-19125\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_drawing-1_HRES_CMYK.jpg\" alt=\"Tripod_drawing 1_HRES_CMYK\" width=\"1080\" height=\"720\" /></a>In Jurassic Park, TriPod is a metaphor for the beginning of time. “This insect is the transition between dinosaurs and what comes next because they’re all still here”, says Maertens.\r\n\r\nAlthough the mosquito preserved in amber was the original inspiration for TriPod, Maertens decided to model the clock after an insect called a water strider (Gerridae) because of its ability to walk on the surface of the water by using surface tension and its long, slender, hydrophobic legs to distribute its weight across a wide area.\r\n\r\n“It feels much like a levitating insect walking over the water,” Maertens explains, “and this inspired me to create something that looks very delicate. This is a direction I like to go, even if it caused some strife with the engineers over issues like stability”.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>All about the movement</strong></span>\r\n\r\nThe plated-brass TriPod stands at just 26 centimeters tall, and its 2.8-kilogram mass is evenly distributed across its three finely sculpted legs.\r\n\r\nLooking down at the dial, which consists of two concentric, rotating discs, is central to determining the time on TriPod, a sculptural clock. The inner disc shows the minutes in 15-second intervals, while the outer disc shows the time of day. The time is read by the observer through the aid of three optical spheres, which together magnify the clock's numerals and make them legible.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC04350-1.jpg\"><img class=\"alignnone size-full wp-image-19127\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC04350-1.jpg\" alt=\"MB&amp;F X L’Epee Tripod\" width=\"1080\" height=\"1620\" /></a>\r\n\r\nThe dial's three sets of numerals 1-12 mean that it takes 36 hours, rather than the usual 12, to make a full rotation, allowing all three \"insect eyes\" to display the time from any vantage point. At any given moment, you can check the time by looking up at the dial or through one of the magnifying lenses (albeit much smaller).\r\n\r\nArnaud Nicolas, CEO of L’Epée 1839, has a master’s degree in optics, so can well explain how making the mineral glass spheres forming the three insect-eye magnifiers was one of the greatest challenges in creating Maertens’ creative vision. “The precision of the sphere had to be very, very accurate,” he explains. “It’s not at all common for a ball-shaped piece of glass to have the tolerance of an optical lens.”\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC04408.jpg\"><img class=\"alignnone size-full wp-image-19128\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC04408.jpg\" alt=\"MB&amp;F X L’Epee Tripod\" width=\"1440\" height=\"960\" /></a>\r\n\r\n<span style=\"font-size: 18pt;\"><strong>All about the structure</strong></span>\r\n\r\nThe designers at L'Epée determined the ideal separation between the dial and the spheres, as well as the optimal size of the spheres so that the time could be read without disrupting the aesthetics of the clock. In other words, TriPod's success was directly related to getting the proportions, magnification, and distances just right. To achieve this, the spheres' shapes had to be manufactured to within 10 microns of perfection, as even the tiniest deviation from perfect alignment would cause the image to blur.\r\n\r\nThe spheres are held in place by brass \"arms\" that cup them like hands, taking care not to scratch or mar their smooth surfaces. Nicolas explains that making the cradles for the lens spheres in one piece, as was required to maximize stability, was challenging. The insect's body armor is made from the same cast acrylic used by MB&amp;F and <a href=\"https://thehourmarkers.com/featuring/the-mbf-medusa-from-the-oceans-to-the-gorgon-of-greek-mythology/\">L'Épée 1839</a> for their three T-Rex iterations, providing the same shock resistance, lightness, and optical clarity.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_LIVESHOT_BLUE_HRES_CMYK.jpg\"><img class=\"alignnone size-full wp-image-19129\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_LIVESHOT_BLUE_HRES_CMYK.jpg\" alt=\"Tripod_LIVESHOT_BLUE_HRES_CMYK\" width=\"1440\" height=\"960\" /></a>\r\n\r\nThese transparent shields are available in eye-catching neon green, blue, and red, and they reveal the intricate workings of the clock mechanism. In addition, the Robocreature's movement can be positioned in the center of its body, just like an insect's, so that it can observe its surroundings in all directions. Every view of TriPod reveals the same structure, with the exception of the creature's visible balance. Maertens confirms that \"these shells\" were influenced by the insect exoskeleton or chitin.\r\n\r\nTriPod is driven by a movement developed and manufactured entirely within L'Epée 1839, and it is finished to the highest standards of traditional Swiss clockmaking. This, however, is unlike any of the other movements in L'Épée 1839. It is a table clock with a gear train, mainspring barrel, balance wheel, escape wheel, and pallet lever—basically the same mechanisms as a wristwatch, only bigger. The regulator on the L'Epée 1839 is equipped with an Incabloc shock protection system, normally found only in wristwatches, to lessen the likelihood of damage during transport.\r\n\r\nThe larger size of the parts might lead one to believe that assembly is easier. However, finishing the movement requires more time than finishing a wristwatch due to the larger surface areas involved.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_MACRO_HRES_CMYK.jpg\"><img class=\"alignnone size-full wp-image-19130\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Tripod_MACRO_HRES_CMYK.jpg\" alt=\"Tripod_LIVESHOT_BLUE_HRES_CMYK\" width=\"1440\" height=\"960\" /></a>\r\n\r\nNicolas explains: “Doubling the size of the components requires much more than simply doubling the time to finish them; the complexity increases exponentially...”. For polishing, you need to apply the same pressure as you would finishing a watch movement but on a bigger surface, and that’s more challenging. It’s thanks to the experience and dexterity of our clockmakers that TriPod can feature such superlative fine-finishing”.\r\n\r\nThere are only 50 of each color of TriPod (neon blue, neon green, and neon red) available. A whole new chapter in their Co-creations!"
	},
	{
		"title": "The Rado True Square Skeleton Lets You Relive The 90s Spirit",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nThe sleek geometry and high-tech ceramic case construction of the <a href=\"https://thehourmarkers.com/featuring/rado-a-world-of-ceramics/\">Rado Ceramica</a> from 1990 established the brand’s prowess in distinctive shapes and modern materials. The modern iterations of this aesthetic highlighted in the True Rado Square result in timepieces that showcase a modern flair on the iconic shape and material amalgam. The design-led nuances of this watch take on an all-new dimension of aesthetic as well as material mastery with the introduction of the <a href=\"https://thehourmarkers.com/featuring/rado-true-square-x-thukral-tagra/\">True Square</a> Skeleton.\r\n\r\n[caption id=\"attachment_19148\" align=\"alignnone\" width=\"1200\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27124162_a.jpg\"><img class=\"size-full wp-image-19148\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27124162_a.jpg\" alt=\"The Rado True Square Skeleton’s case features a monobloc construction in polished ceramic\" width=\"1200\" height=\"900\" /></a> The Rado True Square Skeleton’s case features a monobloc construction in polished ceramic[/caption]\r\n\r\nThe latest iotations in the True Rado Square collection launched as the True Square Skeleton emphasizes Rado’s contemporary status not only as a master watchmaker of unconventional materials but also of style. For <a href=\"https://thehourmarkers.com/featuring/rado-the-captain-cook-over-pole-worldtimer-the-hour-markers/\">Rado</a>, the square shape is reminiscent of a hip-icon and a unique take on ergonomic yet voguish styling which carves a dominant wrist presence.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Timepiece with Extravagant Aesthetics and Visible Mechanical Mastery</strong></span>\r\n\r\nThe unimpeded view of the mechanics with intricate detailing all across serves as a pleasurable delight for the wearer as the True Square Skeleton radiates pure mechanical excellence in all its glory. Nestled within a glorious highly polished ceramic case construction, the timepiece expresses Rado’s pioneering mastery in innovation and application for this lightweight scratch-resistant material.\r\n\r\n[caption id=\"attachment_19149\" align=\"alignnone\" width=\"1200\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LIFESTYLE_R27124162_5.jpg\"><img class=\"size-full wp-image-19149\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LIFESTYLE_R27124162_5.jpg\" alt=\"The latest iteration in Rado’s True Square series is a trio of timepieces featuring a skeletonised movement\" width=\"1200\" height=\"800\" /></a> The latest iteration in Rado’s True Square series is a trio of timepieces featuring a skeletonised movement[/caption]\r\n\r\nThe high-tech monobloc construction allows the expansive array of watch components to be directly built into the ceramic case, thus making way for an extended scope of creative nuances. This timepiece further improves on the hallmarks of the True Square series of which the True Square and True Square Open Heart timepieces garner intense affection among enthusiasts.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Shape of Things to Come - Exploring the Timepieces from Up Close</strong></span>\r\n\r\nOffered in a trio of colorways, the True Square Skeleton watches are cast in the brand’s signature black, plasma, and white monobloc high-tech ceramic. The latest collection features a split-level dial design, with a top plate that has been cut away to reveal captivating views of the R808 automatic movement's precise skeletonization.\r\n\r\n[caption id=\"attachment_19150\" align=\"alignnone\" width=\"1200\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27125152_b.jpg\"><img class=\"size-full wp-image-19150\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27125152_b.jpg\" alt=\"The case construction on Rado True Square Skeleton showcases the pioneering techniques of monobloc ceramic\" width=\"1200\" height=\"900\" /></a> The case construction on Rado True Square Skeleton showcases the pioneering techniques of monobloc ceramic[/caption]\r\n\r\nIn the black and <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-tag-heuer-showcasing-an-innovation-perspective-with-the-first-colored-carrera-plasma-36-mm/\">plasma</a> versions, the anthracite coating of the minute wheel bridge and main plate perfectly complements the nickel hues of the bottom dial plate and its exquisite Côtes de Genève decoration.\r\n\r\n[caption id=\"attachment_19151\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-12.png\"><img class=\"size-full wp-image-19151\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-12.png\" alt=\"Polished black / white / plasma high-tech ceramic case and crown, monobloc construction of Rado True Square Skeleton\" width=\"1440\" height=\"724\" /></a> Polished black / white / plasma high-tech ceramic case and crown, monobloc construction of Rado True Square Skeleton[/caption]\r\n\r\nSimilarly, in the white version, the gold-colored center wheel bridge commands attention and beckons the observer to discover the intricate beauty of the R808 automatic mechanism housed within.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>An Extravagant Yet Minimalistic Design in An Overall Ergonomic Package</strong></span>\r\n\r\nIn the black model, the hands and indexes are coated in a rose gold hue, while in the plasma version, they are silver, and in the white version, they have a yellow-gold tint. All three versions feature a flat <a href=\"https://thehourmarkers.com/featuring/jacob-co-bugatti-chiron-tourbillon-orange-sapphire-crystal/\">sapphire crystal</a> protecting the dial from elements, with dual-face anti-reflective coating.\r\n\r\n[caption id=\"attachment_19152\" align=\"alignnone\" width=\"1200\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27125152_c.jpg\"><img class=\"size-full wp-image-19152\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/TrueSquare_R27125152_c.jpg\" alt=\"Rado's new R808 automatic caliber powers the watch with an autonomy of 80 hours\" width=\"1200\" height=\"900\" /></a> Rado's new R808 automatic caliber powers the watch with an autonomy of 80 hours[/caption]\r\n\r\nAdditionally, a sapphire crystal has been set into the sandblasted titanium case back to provide backstage glimpses of Rado's new R808 automatic caliber. The R808 boasts an antimagnetic Nivachron™ hairspring, which enhances the watch's shock resistance, temperature stability, and magnetic field protection. It also has an 80-hour power reserve. The watch has undergone testing in five different positions to ensure its accuracy.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Rado True Square Skeleton’s Most Distinctive Feature - An Interrupted View of The Movement</strong></span>\r\n\r\nThe True Square Skeleton is overall characterized by its iconic shape and an open-worked skeletonized dial. The minimalist aesthetic closely associated with Rado is elevated with a stunning example of the \"Art of Skeletonisation.\"\r\n\r\n[caption id=\"attachment_19153\" align=\"alignnone\" width=\"1200\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LIFESTYLE_R27125152_1.jpg\"><img class=\"size-full wp-image-19153\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LIFESTYLE_R27125152_1.jpg\" alt=\"The Rado True Square Skeleton offers an elevated expression of true skeletonisation\" width=\"1200\" height=\"1800\" /></a> The Rado True Square Skeleton offers an elevated expression of true skeletonisation[/caption]\r\n\r\nThe dial is segmented into three sections by parallel horizontal lines, emphasizing geometric patterns and key movement components. The top section draws attention to the beating heart of the watch - the balance and its Nivachron™ hairspring. The central section showcases the hands, minute wheel bridge, and movement jewels, while the bottom section unveils the barrel linked with the power reserve.\r\n\r\nThe monobloc high-tech ceramic cases of the black, plasma, and white versions are accompanied by high-tech ceramic link bracelets in matching hues, providing exceptional comfort, lightness, and beauty.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Technical Specifications</strong></span>\r\n\r\nRef. R27126012 - Ref. R27125152 - Ref. R27124162\r\n\r\nMOVEMENT\r\n<ul>\r\n \t<li>Rado calibre R808, automatic, 25 jewels, 3 hands, 80-hour power reserve, antimagnetic Nivachron™ hairspring, exceeds standard test requirements from 3 to 5 positions for higher accuracy</li>\r\n \t<li>R27126012 Dial side with nickel-coloured horizontal Côtes de Genève decoration, yellow-gold-coloured centre wheel bridge, nickel-coloured back side</li>\r\n \t<li>R27125152/ Dial side with horizontal Côtes de Genève decoration and anthracite coating, nickel-coloured</li>\r\n \t<li>R27124162 back side</li>\r\n</ul>\r\nCASE\r\n<ul>\r\n \t<li>Polished white / plasma / black high-tech ceramic case and crown, monobloc construction</li>\r\n \t<li>R27125152 Sandblasted titanium case back with sapphire crystal</li>\r\n \t<li>R27126012 Sandblasted titanium case back with sapphire crystal</li>\r\n \t<li>R27124162 Black PVD sandblasted titanium case back with sapphire crystal</li>\r\n \t<li>Flat sapphire crystal with anti-reflective coating on both faces</li>\r\n \t<li>Water-resistant to 5 bar (50m)</li>\r\n</ul>\r\nDIAL\r\n<ul>\r\n \t<li>Two level dial</li>\r\n \t<li>Top plate skeletonised</li>\r\n \t<li>White / black vertical brushed background</li>\r\n \t<li>Yellow-gold / silver / rose-gold coloured indexes with white Super-LumiNova®</li>\r\n \t<li>Dark grey / white printed minute track</li>\r\n \t<li>Yellow-gold / silver / rose-gold coloured moving anchor symbol on white / black background</li>\r\n \t<li>Yellow-gold-coloured / white / rose-gold coloured printed Rado and Automatic logos</li>\r\n \t<li>R27126012 Bottom plate decorated in continuity with the movement, white colour</li>\r\n \t<li>R27125152 Bottom plate decorated in continuity with the movement</li>\r\n \t<li>R27124162 Bottom plate decorated in continuity with the movement</li>\r\n</ul>\r\nHANDS\r\n<ul>\r\n \t<li>Yellow-gold-coloured with white veneer / silver / rose-gold coloured with white Super-LumiNova®</li>\r\n \t<li>Yellow-gold / silver / rose-gold coloured second hand</li>\r\n</ul>\r\nBRACELET\r\n<ul>\r\n \t<li>White / plasma / black polished high-tech ceramic</li>\r\n \t<li>Titanium 3-fold clasp</li>\r\n</ul>\r\nDIMENSIONS\r\n<ul>\r\n \t<li>38.0 x 44.2 x 9.7 (WxLxH in mm)</li>\r\n</ul>"
	},
	{
		"title": "H.Moser’s Smoked Salmon Streamliner Centre Seconds Strikes A Balance Between Elegance And Vintage",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\n<a href=\"https://thehourmarkers.com/featuring/h-moser-cie-introduces-a-new-40mm-case-and-arctic-blues-in-the-pioneer-collection/\">H. Moser &amp; Cie.</a> is expanding its offerings with the release of the Smoked Salmon Streamliner Centre Seconds, joining the Streamliner Centre Seconds Matrix Green (also known as the \"Green Dragon\"). This three-hand timepiece strikes the ideal balance between classic elegance and a vintage vibe. This limited-edition release will only be sold for a single year.\r\n\r\nThe Streamliner Centre Seconds is a cushion-shaped steel case that is water resistant to 12 ATM, and it takes its name and design cues from the first high-speed trains of the 1920s and 1930s. The case has no lugs, and the steel bracelet is an integral part of the design, making it extremely comfortable to wear. A nod to the traditional odd shapes typical of Moser cases, the middle of the case is hollowed and satin-finished on the sides, with alternating brushed and polished surfaces. The sapphire crystal on top is subtly curved, and the transparent case back echoes this design element. The integrated steel bracelet gracefully follows the wrist's natural curves. This bracelet's intricate design reflects its organic inspiration: its lines are smooth and flowing. Each articulated link has a vertical brushed finish and a polished surface, creating a soft wave. This bracelet is a technical marvel, a work of art that manages to be both subtle and sophisticated while still being incredibly adaptable.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HMoser_6200-1207_doub-L-1429x1536-1.jpg\"><img class=\"alignnone size-full wp-image-19218\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HMoser_6200-1207_doub-L-1429x1536-1.jpg\" alt=\"H.Moser’s Smoked Salmon Streamliner Centre Seconds\" width=\"1429\" height=\"1536\" /></a>\r\n\r\nH. Moser &amp; Cie. has introduced a brand-new fumé dial called Smoked Salmon to complement the steel of the case and the bracelet. This colour, a staple in <a href=\"https://thehourmarkers.com/in-my-opinion/art-of-watch-collecting-horology/\">Haute Horology</a>, gives the watch a wonderful sense of antiquity. Incredible vibrancy, it morphs from chocolate to gold and back again as the wrist is moved. The dial is constantly playing with light, shifting from black to a surprising mirror effect and featuring a griffé finish only found on special editions (this model will only be available for one year). The hour and minute hands are made of two pieces, each with an insert made of the revolutionary ceramic-based material Globolight®, which contains Super-LumiNova®.\r\n\r\n<a href=\"https://thehourmarkers.com/featuring/the-h-moser-cie-endeavour-small-seconds-total-eclipse-x-the-armoury/\">Edouard Meylan</a>, CEO of H. Moser &amp; Cie. and a seasoned fly fisherman, responds to critics who say the fish does not look like salmon by saying, \"Here is salmon and there is salmon. Our inspiration does not come from the traditional Atlantic salmon, or \"Salmo salar\" to give it its Latin name, but from its very rare cousin, the \"Oncorhynchus kisutch\". Allowed to mature in total freedom and massaged each day by specialists using an oil infused with aromatic herbs picked from the slopes of the Himalayas, this species only eats crustaceans that have been pre-digested by pink flamingos. Each individual fish is smoked using a secret recipe made using Scottish whisky. This is what gives the flesh this exceptional color, and is the inspiration behind our new dial.”\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HMoser_6200-1207_doub_R-1429x1536-1.jpg\"><img class=\"alignnone size-full wp-image-19219\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HMoser_6200-1207_doub_R-1429x1536-1.jpg\" alt=\"H.Moser’s Smoked Salmon Streamliner Centre Seconds Caseback\" width=\"1429\" height=\"1536\" /></a>\r\n\r\nThe in-house developed, designed, and manufactured HMC 200 automatic caliber powers the Streamliner Centre Seconds Smoked Salmon model. Precision Engineering AG, a subsidiary of <a href=\"https://thehourmarkers.com/featuring/h-moser-cie-upgrade-swiss-alp-watch/\">H. Moser &amp; Cie</a>., supplied the regulating organ. Featuring a large, engraved, solid gold oscillating weight and a minimum three-day power reserve, the HMC 200 caliber is decorated with the iconic Moser double stripes.\r\n\r\nOriginal and distinctive Haute Horlogerie from H. Moser &amp; Cie."
	},
	{
		"title": "Seiko 5 Sports Collection Gets New 38mm Variants Available In Four New Models",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nThe re-launch of the iconic <a href=\"https://thehourmarkers.com/featuring/seiko-5-sports-masked-rider-a-limited-edition-timepiece-unveiled-to-celebrate-the-55th-anniversary/\">Sports 5</a> collection marked a major revival for <a href=\"https://thehourmarkers.com/featuring/seiko-unveils-new-designs-in-their-collections-celebrating-110-years-of-watchmaking/\">Seiko</a>, a brand with a cult following among mechanical watch enthusiasts. Now, Seiko has introduced four new timepieces in its Seiko 5 Sports collection, featuring a well-proportioned 38mm mid-sized case inspired by one of Seiko's iconic sports watches. The dial colors pay homage to Seiko's beloved diver's watches, which first gained popularity in the 1980s.\r\n\r\nThe ancestry of these mid-sized releases can be traced back to the original Seiko Sports 5 model which celebrates its 55th Anniversary in 2023.\r\n\r\n[caption id=\"attachment_19227\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SRPK33_a_RGB.jpg\"><img class=\"size-full wp-image-19227\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SRPK33_a_RGB.jpg\" alt=\"Like their ancestors, the new variants adhere to the 5 traits\" width=\"1440\" height=\"2160\" /></a> Like their ancestors, the new variants adhere to the 5 traits[/caption]\r\n\r\nFor more than half a century, <a href=\"https://thehourmarkers.com/featuring/seiko-5-sports-auto-moai-limited-edition-watch/\">Seiko 5 Sports</a> has been the go-to choice for enthusiasts of <a href=\"https://thehourmarkers.com/featuring/watches-wonders-2023-bell-ross-complex-technical-marvel-in-a-skeletonised-mechanical-affair-in-the-br05-collection/\">mechanical watches</a> worldwide, thanks to its unparalleled dependability, sturdiness, efficiency, and value. Now, with a brand-new design and an extensive new series, this beloved watch is being reborn. Welcome to the new Seiko 5 Sports collection - a line that embodies the same enduring values, but with a modern and updated appearance.\r\n\r\n[caption id=\"attachment_19228\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SRPK35_a_RGB.jpg\"><img class=\"size-full wp-image-19228\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SRPK35_a_RGB.jpg\" alt=\"The latest Sports 5 models feature a 38mm stainless steel case construction\" width=\"1440\" height=\"960\" /></a> The latest Sports 5 models feature a 38mm stainless steel case construction[/caption]\r\n\r\nSince the launch of the collection in 1963, Seiko Sports 5 timepieces have been aimed at a younger collector audience with an aspiration for style and value. The symbolic 5 traits making up these nuances for the ‘5’ collection which were an automatic movement, a day/date window, water resistance, a crown at 4 o'clock, and rugged construction continue to inspire the profiles and aesthetic for the latest iterations, this time available in four new timepieces.\r\n\r\n[caption id=\"attachment_19229\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/5S_SKXmid_KV_V_RGB-1.jpg\"><img class=\"size-full wp-image-19229\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/5S_SKXmid_KV_V_RGB-1.jpg\" alt=\"A choice of four new dial options is available\" width=\"1440\" height=\"2037\" /></a> A choice of four new dial options is available[/caption]\r\n\r\nFunction-focused minimalistic designs don’t go better than Seiko 5 Sports watches now introduced in mid-size <a href=\"https://thehourmarkers.com/in-conversation/in-conversation-with-jean-marc-pontroue-ceo-of-panerai-on-the-radiomir-collection-and-more-at-watches-and-wonders-2023/\">38mm</a> case construction. These timepieces foster a compulsive desirability inspired by the simplicity and cultivate a timeless affection for neo-vintage aesthetics.\r\n\r\n<strong>Technical Specifications:</strong>\r\n\r\nMovement\r\nCaliber Number- 4R36\r\nMovement Type - Automatic with manual winding\r\nPower reserve - Approx. 41 hours\r\nJewels - 24\r\n\r\nFunctions\r\n<ul>\r\n \t<li>Stop second hand function</li>\r\n \t<li>Day/Date display</li>\r\n</ul>\r\nCase/Band\r\nCase Material - Stainless steel\r\nCase Size -\r\n<ul>\r\n \t<li>Thickness: 12.1mm</li>\r\n \t<li>Diameter: 38.0mm</li>\r\n \t<li>Lug-to-lug: 44.2mm</li>\r\n</ul>\r\nCrystal - Hardlex\r\nLumiBrite - Lumibrite on hands and index(es)\r\nClasp - Three-fold clasp with push button release\r\nBracelet Length - 205.0mm\r\nDistance between lugs - 20mm\r\n\r\nOther Details\r\nWater Resistance - 10 bar\r\nMagnetic Resistance - 4,800 A/m\r\nWeight - 140.0g\r\n\r\nFeatures\r\n<ul>\r\n \t<li>Unidirectional rotating bezel</li>\r\n \t<li>Three-fold clasp with secure lock</li>\r\n \t<li>See-through &amp; Screw case back</li>\r\n</ul>"
	},
	{
		"title": "Sherpa OPS and Ultradive: A Tale of Rebirth, Buddhist Good Vibes and Genuine Passion for Vintage",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nResurrection is a phenomenon that bears witness to the immense power of God himself. So, whether the rebirth of a beloved watch from the past hints towards the divine nature of the horological forces is a question we are going to answer.\r\n\r\nA plethora of watch companies has faced a dominant revival after their brief or extended stages of extinction. Myriad names in the current watchmaking domain have followed the fortunate trends of overcoming these temporary conditions and are being reincarnated as vintage-inspired yet contemporarily packaged mechanical objects.\r\n\r\nAmong the many brands from the past that deserve a shoutout in the modern horological creations is the brand Enicar. Giving life to the iconic timepieces from the past and fuelling the innovation for this passion project is a Swiss-born mechanical engineer turned watchmaker Martin Klocke who not only tasked himself and his small team with the revival of iconic timepieces dearly missed by enthusiasts for roughly 60 years but also climb the steep slopes of the treacherous endeavors required in starting a watch company during a pandemic.\r\n\r\n[caption id=\"attachment_19240\" align=\"alignnone\" width=\"1080\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_Portrait_Martin_05.jpg\"><img class=\"size-full wp-image-19240\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_Portrait_Martin_05.jpg\" alt=\"Martin Klocke, founder of Sherpa Watches\" width=\"1080\" height=\"1620\" /></a> Martin Klocke, founder of Sherpa Watches[/caption]\r\n\r\nSo, apart from the enthusiastic verve of man, we sense a holy divine intervention to make the impossible possible.\r\n\r\nSo, have we ended the theistic debate once and for all?\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Tooly and Stealthy Aesthetic</strong></span>\r\n\r\n[caption id=\"attachment_19241\" align=\"alignnone\" width=\"1080\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-ovd-8.jpg\"><img class=\"size-full wp-image-19241\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-ovd-8.jpg\" alt=\"The Sherpa Watches OPS with a dominant aesthetic and functional inspiration from the original Enicar OPS watch\" width=\"1080\" height=\"720\" /></a> The Sherpa Watches OPS with a dominant aesthetic and functional inspiration from the original Enicar OPS watch[/caption]\r\n\r\nPaying an honest homage to the Enicar watches from the golden age of tool watches, the Sherpa OPS and Ultradive models not only pay a tribute to the past heroes but revive a duo of cult classic timepieces altogether without cutting any corners when it comes to aesthetics, functionality, and overall watchmaking prowess.\r\nInspired by the compressor case styles of the late 60s Enicar watches, these modern iterations of the watches that are still very hot in the pre-loved market represent the pinnacle of a tool watch aesthetic and an uncompromising utilitarian package.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Enicar - An Undeniable Inspiration and a Worthy Ancestor</strong></span>\r\n\r\nBehind Martin Klocke’s inceptive genius is a fan-boy allure for the Enicar vintage watches. Deriving direct inspiration from the glory age of the legendary <a href=\"https://thehourmarkers.com/industry-news/louis-vuitton-announces-the-revival-of-the-legendary-artists-brand-gerald-genta/\">Swiss brand</a>, Martin presents a fresh take on the iconic timepieces from the 60s with his creations, the Sherpa OPS and Sherpa Ultra drive.\r\n\r\n[caption id=\"attachment_19242\" align=\"alignnone\" width=\"1080\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_LifestylePhotography_Ultradive_01.jpg\"><img class=\"size-full wp-image-19242\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_LifestylePhotography_Ultradive_01.jpg\" alt=\"Both the Sherpa OPS and Ultradive (pictured above) feature a unique case conduction inspired by vintage Enicar watches from the 60s\" width=\"1080\" height=\"720\" /></a> Both the Sherpa OPS and Ultradive (pictured above) feature a unique case conduction inspired by vintage Enicar watches from the 60s[/caption]\r\n\r\nA family business founded in 1917, Enicar was a Swiss watchmaking brand that operated for a few decades. Their total production volume during that period is approximately 800,000 pieces until they eventually had to file for bankruptcy in 1987.\r\n\r\nIn the latter stages of life, the name ‘Enicar’ was purchased by a Chinese Investment Group, and under the name they still produce a few models of fashion watches.\r\n\r\nA vintage Enicar is undoubtedly a cult classic icon and tends to be highly collectible. Cementing their celebrity allure is the fact that Ed Sheeran and Alain Delon have been proud owners of vintage Enicar dive watches.\r\n\r\nAs the first of its offerings, Sherpa introduced a fresh iteration of the Enicar Ultradive watch featuring a signature super compressor case construction honest with the authentic Ultradive watches.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Looks And Technology with Vintage Pedigree and a Contemporary Quality Standard</strong></span>\r\n\r\nReinterpreting the waterproof super compressor case construction with an internal rotating bezel and dual crowns to operate the same, the watches feature bayonet compressor lock closure (EPSA-STOP) and twin compressor crowns (Monoflex), invented by legendary watch case maker Ervin Piquerez SA (EPSA).\r\n\r\n[caption id=\"attachment_19243\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_LifestylePhotography_OPS_02.jpg\"><img class=\"size-full wp-image-19243\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/MC_LifestylePhotography_OPS_02.jpg\" alt=\"A super compressor style case with 3 o'clock case flanks is an iconic hallmark for the new watches\" width=\"1440\" height=\"960\" /></a> A super compressor style case with 3 o'clock case flanks is an iconic hallmark for the new watches[/caption]\r\n\r\nThe timeless utilitarian aesthetic is transposed in an attractively contemporary package without much compromise of the original form or function. If a decent retro-inspired dive watch is your taste, then be prepared to be more than just thrilled with the Sherpa OPS and Sherpa Ultradive.\r\n\r\nTheir debut pair of dive watches is almost identical to the original except for several nuances such as with the case finishing, bezel action, movement as well as overall styling cues. Measuring 40mm in diameter, the timepieces highlight the hallmark compressor case aesthetic with their domed sapphire crystals and inner rotating bezels. The dominant 3 o’clock case flank is an aesthetic feature as rare as hens’ teeth in modern watchmaking design thus serving these watches a unique appeal.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Watch with a Case to Make: Understanding the EPSA Super Compressor Case Design</strong> </span>\r\n\r\nDiving deep into the engineering of the super compressor case featured on the Sherpa Ultradive and Sherpa OPS watches reveals a 40mm size identical to the original Sherpa models. The Monoflex compressor crown technology has been revived after 60 years in a contemporary timepiece to a full-scale by following a ground-breaking innovation.\r\n\r\nWhile for many, a dive watch with dual crowns is a perfect definition for a super compressor watch, the buck doesn’t stop there as there is much more in the game. The Sherpa Ultradive and Sherpa OPS are true supercompressor watches.\r\n\r\n[caption id=\"attachment_19244\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-watches-ultradive-10.jpg\"><img class=\"size-full wp-image-19244\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-watches-ultradive-10.jpg\" alt=\"Crosshatched non-screw-down crowns on the Sherpa Ultradive\" width=\"1440\" height=\"960\" /></a> Crosshatched non-screw-down crowns on the Sherpa Ultradive[/caption]\r\n\r\nThe watches feature a patented case-sealing method developed by the veteran watch case maker Ervin Piquerez SA (EPSA). This patented case design takes advantage of the water pressure to press the case back against the O-ring seal so that the water-tightness of the case increases with a gradual increase in depth. This unique design loads the rubber seals only when required, thus enhancing the longevity of the water-resistance properties of the watch.\r\n\r\nSurprising for ISO 6425-certified dive watches, the Sherpa Ultradive and Sherpa OPS feature non-screw-down crowns thanks to the Monoflex crown technology. A tubular-shaped seal slides over the crown tube and the rising water pressure firmly presses the seal onto the tube.\r\n\r\nThe greater the depth, the better the watch copes with its water tightness!\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Much More Than Just Retro Dive Watches: The Sherpa OPS And Sherpa Ultradive</strong></span>\r\n\r\nRugged mechanics, modern materials, exquisite finishing, and 200-meter water resistance all make the Sherpa OPS and Sherpa Ultradive watches crave. As beautifully put forward by Martin Klocke himself, “The timeless designs of the Ultradive and the OPS did not need much finetuning, as their look and feel are as outspoken today as they were half a century ago. On a technical level, our watches surpass their predecessors regarding the accuracy, water tightness, and durability.”\r\n\r\n[caption id=\"attachment_19245\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC09164.jpg\"><img class=\"size-full wp-image-19245\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC09164.jpg\" alt=\"The Sherpa OPS incorporates modern materials and production technologies to achieve 200-meter water resistance\" width=\"1440\" height=\"960\" /></a> The Sherpa OPS incorporates modern materials and production technologies to achieve 200-meter water resistance[/caption]\r\n\r\nThe Monoflex crowns and EPSA-STOP <a href=\"https://thehourmarkers.com/featuring/girard-perregaux-welcomes-back-the-casquette-2-0/\">case back</a> on both models are equipped with newly developed compressor technology, which draws inspiration from EPSA designs and incorporates modern materials and production technologies. The compressor crowns are so unique that Sherpa Watches has chosen to manufacture them in-house, using high-quality German and Swiss components. Although highly water-resistant even at great depths, these crowns do not require screwing down for easy handling.\r\n\r\nFor the first time in over 60 years, a complete compressor watch has been created. These watches have undergone rigorous testing and are ISO 6425 certified to 200 meters to prove the quality of their construction before leaving the company.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Diving Deep with The Buddhist Mantra of The Sherpas</strong></span>\r\n\r\nThe founder of Sherpa watches, Martin Klocke ascribes to Buddhist traditions and in doing so pays a tribute to the Sherpa people, without whom none of the Everest expeditions would be possible. The Buddhism influences in the timepieces take on a legendary flair as both the Sherpa OPS and Sherpa Ultradive feature laser engraved wheels inside the movement, containing a traditional Tibetan Buddhist mantra, making these models the world’s first good vibes watches.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-17.png\"><img class=\"alignnone size-full wp-image-19246\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-17.png\" alt=\"Martin Klocke\" width=\"2138\" height=\"957\" /></a>\r\n\r\nMartin Klocke is a Buddhist and it was his idea to express the Himalayan Buddhist tradition of prayer wheels on the movement wheels\r\n\r\nThe aesthetic cues along the package effortlessly result from Buddhism influences and are transposed in a tangible affair with the Buddhist mantra engraved in moving parts.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Mantramatic Movement: A Dominant Religious Affair for Precision Timekeeping Excellence</strong></span>\r\n\r\n[caption id=\"attachment_19247\" align=\"alignnone\" width=\"2220\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Seconds-Wheel-coin-ausschnitt.jpg\"><img class=\"size-full wp-image-19247\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Seconds-Wheel-coin-ausschnitt.jpg\" alt=\"Laser-engraved Tibetan Buddhist mantra “Om Mani Peme Hung” on the movement wheels\" width=\"2220\" height=\"1801\" /></a> Laser-engraved Tibetan Buddhist mantra “Om Mani Peme Hung” on the movement wheels[/caption]\r\n\r\nAn original feature on the Sherpa OPS and Sherpa Ultradive models is the microscopic laser-engraved Tibetan Buddhist mantra “Om Mani Peme Hung” very commonly used in the Sherpa region on two of the moving wheels. Transcending the ordinary and presenting something unique, the timepieces are powered by the Mantramatic MM01 movement, based on Swiss-made Sellita Calibre SW200-1 automatic but with a philosophical twist.\r\n\r\n[caption id=\"attachment_19248\" align=\"alignnone\" width=\"1080\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Mantramatic-Movement-blackBG.jpg\"><img class=\"size-full wp-image-19248\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Mantramatic-Movement-blackBG.jpg\" alt=\"Both the Sherpa OPS and Ultradive watches are powered by the Mantramatic MM01 movement\" width=\"1080\" height=\"810\" /></a> Both the Sherpa OPS and Ultradive watches are powered by the Mantramatic MM01 movement[/caption]\r\n\r\nThe mantra engraving follows a widespread Himalayan Buddhist tradition used in prayer wheels, where the movement's gears continuously rotate, emitting vibrations of love, wisdom, and compassion from the wearer's wrist into the world - approximately 30 million times per year. Although the mantra is invisible to the naked eye, its presence can be felt.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Faithful And Relentless as A Sherpa - Let’s Talk About the Specs</strong></span>\r\n\r\nThe Sherpa Ultradive and Sherpa OPS are almost indistinguishable except for minor variations in the case finish, dial, and bezel design. While the OPS features a stealthy black DLC coating, the Ultradive is packaged in a polished finish case.\r\n\r\nThe silver bezel with orange accents on the steel model contrasts with the black dial, while the black DLC-coated OPS model is predominantly monochromatic.\r\n\r\n[caption id=\"attachment_19249\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-1-7.png\"><img class=\"size-full wp-image-19249\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-1-7.png\" alt=\"The Sherpa OPS and Ultradive watches have minor variations in case, bezel, and dial design or finishing\" width=\"1440\" height=\"600\" /></a> The Sherpa OPS and Ultradive watches have minor variations in case, bezel, and dial design or finishing[/caption]\r\n\r\nAs spot-on modern renditions of the 60s classic icons, the Sherpa Ultradive and Sherpa OPS are purposeful dive friendly, and well-engineered to be at-home even in oceanic depths, 200 meters to be precise. The unusual case shape with the dual crown layout is a captivating element of the timepieces. The crowns at 2 o’clock and 4 o’clock feature the crosshatch motif and perform bezel rotation and movement winding + time setting duties respectively.\r\n\r\n[caption id=\"attachment_19250\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-watches-ultradive-9.jpg\"><img class=\"size-full wp-image-19250\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/watchdavid-sherpa-watches-ultradive-9.jpg\" alt=\"Case back of the new Sherpa Ultradive with a classic EPSA dive helmet engraving\" width=\"1440\" height=\"960\" /></a> Case back of the new Sherpa Ultradive with a classic EPSA dive helmet engraving[/caption]\r\n\r\nThe modified top-of-the-range Sellita SW200-1 automatic movement powering the watch to the autonomy of 38 hours features an intricate gilt finish while the case backs feature the engravings of the classic EPSA dive helmet.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Revived From Archives and Embodying the Spirit to Give Back</strong></span>\r\n\r\nMartin Klocke believes that by utilizing the Sherpa name as a brand and reaping the benefits of its reputation, Sherpa Watches has a moral obligation to give back.\r\n\r\nHe says that “Sherpa Watches will donate a percentage of every watch sold and give it to a good cause in the Sherpa area in Nepal. For our first two watch models, we chose “Sagarmatha Next” in the Khumbu region and the “Nepal Himalaya Sherpa Foundation” in Kathmandu, both supporting different projects in the Sherpa regions of Nepal”.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Defending the Pricing and Final Takeaways</strong></span>\r\n\r\nThe Sherpa Ultradive and Sherpa OPS timepieces are priced at €5,900 and €5,800 respectively. Although the pricing seems to be a bold move from a brand that is still novel on the watch front, the watches do carry a significant substance in terms of technology and style. While the price point sure will be a difficult marketing challenge for the brand, the product quality is omnipresent to justify the same.\r\n\r\nWhile vintage Enicars garner a similar price point as the Sherpa watches, genuine hype for the Sherpa Ultradive and Sherpa OPS timepieces will make the prices more acceptable.\r\n\r\n[caption id=\"attachment_19251\" align=\"alignnone\" width=\"1080\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC00010.jpg\"><img class=\"size-full wp-image-19251\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC00010.jpg\" alt=\"Sherpa brand revives true super compressor dive watches after 60 years\" width=\"1080\" height=\"1621\" /></a> Sherpa brand revives true super compressor dive watches after 60 years[/caption]\r\n\r\nThe toolish, field watch, and dive watch vibes radiated in abundance by the Sherpa Ultradive and Sherpa OPS timepieces win you over instantly and the undeniable vintage connection is a sure allure for the same.\r\n\r\n<strong>Pricing and Availability</strong>\r\n\r\nSherpa Ultradive - Retail price: €5,900 incl. 19% VAT\r\nSherpa OPS - Retail price: €5,800 incl. 19% VAT\r\nBoth the Sherpa Ultradive and Sherpa OPS are available via Sherpa Watches directly.\r\nThe timepieces are limited to 150 pieces each.\r\n\r\n<strong>Technical Specifications:</strong>\r\n\r\n<strong>The Sherpa Ultradive</strong>\r\nStainless steel case, polished, EPSA-STOP compressor case back construction\r\nDiameter/height: 40,0 / 13,5 mm\r\nDomed <a href=\"https://thehourmarkers.com/featuring/tag-heuer-carrera-x-porsche-limited-edition-where-a-shared-passion-meets-history/\">Sapphire box glass</a>, internal anti-reflex coating, and inner black metallisation on the outer rim\r\n360° rotating inner bezel, marked with Swiss Super-LumiNova Grade X1\r\nTop compressor crown to operate the inner bezel (must be pulled for operation), no screw-down\r\nFull crown protection, to avoid entanglement and shocks while diving\r\nBottom compressor crown to operate the hands and set the date, no screw down\r\nFully water resistant up to 20 bar, certified to ISO 6425 [4.7.4 and 4.7.10] up to 200m\r\nMantramatic MM01 movement, based on Swiss made Sellita Calibre SW200-1 automatic, premium\r\n(top) grade, fine decor, gilt finish, custom rotor\r\n38 hrs power reserve\r\nSculpted lugs with 20 mm band width\r\nAll components of the watch are produced and assembled in Germany and Switzerland\r\nTropic style watch strap, made of robust vulcanised rubber – black or white\r\nPackaging: Double watch travel roll, made in the EU of 100% finest Italian leather inside out\r\n\r\n<strong>The Sherpa OPS</strong>\r\nStainless steel case, very durable satin black DLC (Diamond Like Carbon) coating, EPSA-STOP\r\ncompressor case back construction\r\nDiameter / height: 40,0 / 13,5 mm\r\nDomed Sapphire box glass, internal anti-reflex coating and inner black metallisation on the outer rim\r\n360° rotating inner bezel, marked with Swiss <a href=\"https://thehourmarkers.com/featuring/rado-diastar-original-60-year-anniversary-edition-the-latest-chapter-in-the-success-story-of-the-worlds-first-scratch-resistant-watch/\">Super-LumiNova</a> Grade X1\r\nTop compressor crown to operate the inner bezel (must be pulled for operation), no screw-down\r\nFull crown protection, to avoid entanglement and shocks while diving\r\nBottom compressor crown to operate the hands and set the date, no screw-down\r\nFully water resistant up to 20 bar, certified to ISO 6425 [4.7.4 and 4.7.10] up to 200m\r\nMantramatic MM01 movement, based on Swiss made Sellita Calibre SW200-1 automatic, premium\r\n(top) grade, fine decor, gilt finish, custom rotor\r\n38 hrs power reserve\r\nSculpted lugs with 20 mm band width\r\nAll components of the watch are produced and assembled in Germany and Switzerland\r\nTropic style watch strap, made of robust vulcanised rubber\r\nPackaging: Double watch travel roll, made in the EU of 100% finest Italian leather inside out"
	},
	{
		"title": "Rado Diastar Original 60-Year Anniversary Edition - The Latest Chapter in The Success Story of The World’s First Scratch-Resistant Watch",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nMaintaining a consistent design language and introducing only microscopic aesthetic alterations over a period of more than half a century testifies to the omnipresent charm of successful design creation.\r\n\r\nRado is fond of this trend and over decades, its premium offerings from the current catalog can be confused with their inceptive models dating back more than 70 years. Embodying the philosophy, “if it ain't broke, don't fix it” is taken to an all-new level with a timepiece that has hardly changed since its birth 60 years ago.\r\n\r\n[caption id=\"attachment_19334\" align=\"aligncenter\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Side-View-Cut_300dpi-Large.jpeg\"><img class=\"wp-image-19334 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Side-View-Cut_300dpi-Large.jpeg\" alt=\"The timelessly iconic shape of the Rado Diastar Original 60th Anniversary watch\" width=\"1280\" height=\"958\" /></a> The timelessly iconic shape of the Rado Diastar Original 60th Anniversary watch[/caption]\r\n\r\nYes, we are talking about the faithful expression of affordable opulence - The <a href=\"https://thehourmarkers.com/featuring/rado-true-square-x-thukral-tagra/\">Rado Diastar</a>, which celebrated its 60th Anniversary in 2022 with the launch of a modern reinterpretation of the original Diastar as a special edition designed by the Swiss-Argentine minimalist of high acclaim - Alfredo Häberli.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Modern Face of a True Design Icon</strong></span>\r\n\r\nAs a timepiece accoladed for its ground-breaking use of advanced materials and futuristic aesthetics, the original Diastar was already a showstopper in 1962. Combining bold nuances such as a distinctive oval cushion-styled case shape with a faceted crystal for intense visual depth and also presenting novel material technology innovation, the Diastar was intended to outshine and outlast all other watches in the market.\r\n\r\n[caption id=\"attachment_19335\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC07308_final_A5-Large.jpeg\"><img class=\"wp-image-19335 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC07308_final_A5-Large.jpeg\" alt=\"In 2022, the Diastar Original 60th Anniversary edition was launched in a Ceramos case construction\" width=\"1280\" height=\"854\" /></a> In 2022, the Diastar Original 60th Anniversary edition was launched in a Ceramos case construction[/caption]\r\n\r\nFast-forward 60 years, we celebrated the success story of the Diastar with the launch of the Diastar Original 60-Year Anniversary Edition in 2023 as a special edition with no production limits to wow Diastar enthusiasts all across the globe. The special edition watch with subtle yet notable alterations follows Rado’s unhindered commitment to material research as this time the watch is constructed out of a case made of Ceramos - a material that combines the hardness of ceramics with a metallic lustre.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Diastar Story - A Tale of Many Firsts and Commitment to Innovation</strong></span>\r\n\r\nThe original Diastar was born in 1962 out of a simple yet strong commitment to creating an accurate and eternally beautiful timepiece. Culminating out of an unhindered effort to strive for the best, the watch was launched as the world’s first scratch-proof watch.\r\n\r\nThe watch essentially embodied the intense fashion evolution which was synonymous with the 1960s. Marketing the Diastar as the first scratch-proof disruptive watch offering resulted from a pioneering material innovation that highlighted the technical prowess of Rado. The watch was crafted from an ultra-resistant and durable alloy called ‘Hardmetal’ which was essentially composed of tungsten carbide powder. It was patented by Rado on November 28, 1961.\r\n\r\nSuch innovations carved <a href=\"https://thehourmarkers.com/featuring/the-rado-true-square-skeleton-lets-you-relive-the-90s-spirit/\">Rado</a> the reputation for being the “master of materials”.\r\n\r\n[caption id=\"attachment_19336\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DiaStar_R12160103_R12160213_R12160303_PR-Large.jpeg\"><img class=\"size-full wp-image-19336\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DiaStar_R12160103_R12160213_R12160303_PR-Large.jpeg\" alt=\"Also launched in 2022, the latest standard Diastar Original models\" width=\"1280\" height=\"852\" /></a> Also launched in 2022, the latest standard Diastar Original models[/caption]\r\n\r\nThis diamond-like resistance and indestructible shine made the name “Diastar” an absolute natural. The clever fusion of those two words has been the model’s very evocative moniker ever since.\r\n\r\nThe scratch-proof competence continued along the watch crystal which was made out of sapphire glass. In the 1960s, it was an uncommon sight and only watchmakers like Rado dared to feature it on their timepieces.\r\n\r\nThe material working challenges of Hardmetal which couldn’t be machined easily due to the lack of precision laser-guided CNC machines during the era resulted in the distinctive oval case shape which became a symbol of sheer beauty in the industry. The Diastar shape was born and rapidly wowed watch enthusiasts all across the world.\r\n\r\nAs emotionally put forward by Rado CEO Adrian Bosshard, “For decades, watch connoisseurs have been wearing this watch. I have distinct memories from my childhood about family members and their acquaintances wearing a Diastar and today, those watches still look like new. This certainly is one reason for me becoming a watch-lover myself and I am proud that the Rado Diastar Original has a firm place in the bestseller list of many countries around the globe, to this day.”\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Rado Diastar Upgrades</strong></span>\r\n\r\nThe original Rado Diastar has gone through myriad design evolutions and the CEO Adrian Bosshard attributes the long-term success of the timepiece to its distinctive shape and features he states, “to keep the strong personality of its predecessor, while also adding the best and latest innovations.”\r\n\r\nHe further adds that, “This iconic product is totally unique in both shape and design. The choice of the material for the case - hard metal before and now Ceramos in the new collection - makes the watch practically indestructible. It is truly a watch for a lifetime.”\r\n\r\n[caption id=\"attachment_19337\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC07485_final_A5-Large.jpeg\"><img class=\"size-full wp-image-19337\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/DSC07485_final_A5-Large.jpeg\" alt=\"The watch designed by Alfredo Häberli keeps alive the original Diastar DNA\" width=\"1280\" height=\"854\" /></a> The watch designed by Alfredo Häberli keeps alive the original Diastar DNA[/caption]\r\n\r\nAs the years followed, the Diastar continued to evolve in size, materials, complications as well as movement variants of automatic or quartz. Even 60 years later, the Rado Diastar continues to be impressive for reasons beyond just design as its material and technical innovation is captivating beyond words.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Alfredo Häberli - The Designer</strong></span>\r\n\r\nFor designing the Rado Diastar Original 60th Anniversary timepiece, Rado picked the right man. Alfredo Häberli is a designer guided by Swiss precision philosophy and a Latin passion! The Argentine-born designer based in Switzerland is renowned for minimalistic designs and his works exhibit the signature traits of out-of-the-box designs that intertwine with material innovation.\r\n\r\n[caption id=\"attachment_19338\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Portrait_A.Haeberli_4-Large.jpeg\"><img class=\"size-full wp-image-19338\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Portrait_A.Haeberli_4-Large.jpeg\" alt=\"Portrait of Alfredo Häberli - Designer of the Diastar Original 60th Anniversary Edition timepiece\" width=\"1280\" height=\"853\" /></a> Portrait of Alfredo Häberli - Designer of the Diastar Original 60th Anniversary Edition timepiece[/caption]\r\n\r\nThe brief for Alfredo was simple, “don’t change a lot but change what is necessary while maintaining the root DNA of the timeless product”. Alfredo didn’t change a lot but still managed to make the iconic watch look distinctively contemporary.\r\n\r\nAlfredo has been an avid watch lover and his enthusiasm for watches was sparked when at the age of 18 he was gifted a watch by his father. He recalls that, “Since I opened my own design studio more than 30 years ago I haven’t kept up with the times, which means I don’t follow trends. But my never-ending dream is to design a watch.”\r\n\r\nHe expresses the design philosophy of the watch in two words: precision and poetry as he states, “There is precision in the automatic movement, in the material, in the workmanship and geometry, and the poetry lies in the fascinating, ineffable matter of time.”\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Diastar Original 60-Year Anniversary Edition - A Future-Ready Reinterpretation of The Original</strong></span>\r\n\r\nThe Rado Diastar Original 60-Year Anniversary Edition combines material innovation and design excellence while continuing to highlight the trademark aesthetics and technicalities of the collection. Of the hallmark nuances in the latest model, the radially brushed bezel of the Ceramos case, a faceted hexagonal <a href=\"https://thehourmarkers.com/featuring/br01-cyber-skull-sapphire-ufo-of-watchmaking/\">sapphire crystal</a>, and a minimalist dial design set it apart from the original model.\r\n\r\n[caption id=\"attachment_19339\" align=\"alignnone\" width=\"925\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Vertical-View_300dpi-Large.jpeg\"><img class=\"size-full wp-image-19339\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Vertical-View_300dpi-Large.jpeg\" alt=\"The iconic brushed Ceramos bezel and hexagonal faceted crystal\" width=\"925\" height=\"1280\" /></a> The iconic brushed Ceramos bezel and hexagonal faceted crystal[/caption]\r\n\r\nThe product DNA and Diastar roots are omnipresent throughout the timepiece but presented in a modern or contemporary offering with sleek yet noticeable design alterations. The timepiece gives the impression of being a retro offering for the modern wearer.\r\n\r\nThe ancestry of the latest anniversary edition timepiece can be easily traced back to the original Diastar models. With the Ceramos construction, you get a metal-like luster and ceramic-like hardness resulting in an indestructible watch that can maintain its refinement forever.\r\n\r\nThe hexagonal faceted sapphire crystal on the face with its six sharp edges is symbolic of the 6 decades of success for the watch where each facet symbolizes a decade of the love the timepiece has garnered among watch connoisseurs. This unique aesthetic element also makes it appear like a diamond.\r\n\r\nThe watch is powered by the automatic Rado caliber R764 with an autonomy of 80 hours and an anti-magnetic hairspring. The Anniversary Edition timepiece comes paired with an interchangeable stainless steel Milanese mesh bracelet with the option of a grey fabric strap as well for contrast.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Ceramos - Ceramic Like Hardness and Metal Like Luster</strong></span>\r\n\r\nThe <a href=\"https://thehourmarkers.com/featuring/rado-a-world-of-ceramics/\">Ceramos</a> material is an alloy with a dominant titanium carbide composition which makes the package lightweight, scratch-resistant, and lustrous to a higher degree than normal ceramic, metal, or even Hardmetal.\r\n\r\nRado took a big step forward in its material innovation competence with the introduction of the Ceramos material. The novel material presents similar advantages in terms of lightweight, strength, and wearer-friendly nature to ceramic. It is the most modern material in the entire Rado portfolio.\r\n\r\n[caption id=\"attachment_19340\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Detail-Fabric_300dpi-Large.jpeg\"><img class=\"size-full wp-image-19340\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/764_6163_3_511_Detail-Fabric_300dpi-Large.jpeg\" alt=\"The Diastar Original 60th Anniversary Ceramos case is constructed out of an alloy composed of 90% titanium carbide\" width=\"1280\" height=\"1169\" /></a> The Diastar Original 60th Anniversary Ceramos case is constructed out of an alloy composed of 90% titanium carbide[/caption]\r\n\r\nWhat Ceramos allows is a similar materialization and aesthetic outlook as steel. While ordinary ceramic is limited to be available in white, black, or plasma hues, with Ceramic you get steel tones and also achieve PVD coatings all while maintaining a steel-like luster.\r\n\r\nAbout material innovation, designer Alfredo Häberli says that, “History teaches you that much has been created, formally. The material, however, offers a perfect opportunity for real innovation. For the Diastar, the first scratch-resistant watch on the market, its technical innovation attracted a lot of attention. As a Swiss designer, I’m always interested in innovation, which makes it possible to move forward in the history of design.”\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Diastar - The Epic Shape of Time</strong></span>\r\n\r\nThe original Diastar was a futuristic offering that set many benchmarks and firsts in the industry. The 60th Anniversary timepiece pays tribute to that spirit by incorporating novel material innovation and disruptive design philosophy.\r\n\r\nThe core endeavor of the project was to build up on the history and exclusive design language of the brand and introduce subtle changes which are consistent with the Diastar design DNA yet present a contemporary feel to the overall package.\r\n\r\n[caption id=\"attachment_19341\" align=\"alignnone\" width=\"800\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-19.png\"><img class=\"size-full wp-image-19341\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-19.png\" alt=\"The art and the artist - Diastar Original 60th Anniversary watch and designer Alfredo Häberli\" width=\"800\" height=\"503\" /></a> The art and the artist - Diastar Original 60th Anniversary watch and designer Alfredo Häberli[/caption]\r\n\r\nThe beautiful words of Rado CEO Adrian Bosshard sum up the final takeaways for the iconic timepiece, “The Diastar Original has for 60 years been an important pillar in the global Rado collection. I strongly believe that such an iconic product will continue to be a bestseller for the next 60 years.”\r\n\r\n<strong>Technical Specifications:</strong>\r\nRado Diastar Original 60-Year Anniversary Edition\r\n\r\nRef. R12163118\r\n\r\nMovement - Rado calibre R764 (gold plated), automatic, 25 jewels, 3 hands, date and graphical day display with\r\n\r\n2 colour schemes in grey or natural colour Super-LumiNova® at 6 o’clock, 80-hour power reserve, antimagnetic\r\n\r\nNivachron™ hairspring, exceeds standard test requirements from 3 to 5 positions for higher accuracy\r\n\r\nCase - Polished Ceramos™ bezel with polished stainless steel middle part and crown\r\n\r\nHexagon faceted sapphire crystal anti-reflective coating on inside face\r\n\r\nPolished stainless-steel case back\r\n\r\nWater-resistant to 10 bar (100m)\r\n\r\nDial - Metallic grey, circular brushed\r\n\r\nDot indexes filled with natural colour Super-LumiNova®\r\n\r\nHands - Rhodium coloured with natural colour Super-LumiNova®\r\n\r\nRhodium coloured second hand with blind hole\r\n\r\nBracelet - EasyClip system\r\n\r\nSatin brushed stainless steel “Milanese”, polished sides, satin brushed cover with polished openers\r\n\r\nAdditional grey textile strap, satin brushed stainless steel extendable folding clasp and polished pushers\r\n\r\nDimensions - 38.0 x 45.0 x 12.3 (WxLxH in mm)"
	},
	{
		"title": "Label Noir X Courbet: Artisanal Personalization with Two New Territories - Leather Goods and Men's Jewelry",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nThe jeweller <a href=\"https://thehourmarkers.com/history-has-it/jaeger-lecoultres-hidden-treasures-art-deco-at-its-finest-the-hour-markers/\">Courbet</a> has teamed up with the <a href=\"https://thehourmarkers.com/featuring/corum-x-label-noir-a-landmark-timepiece-with-signature-touches-of-the-unique-bubble/\">Label Noir</a> company for the first time in its history to use Swiss know-how. Together, they look at the world of men through four limited-edition bracelets that are a bold take on Courbet's work. The limited editions of Label Noir x Courbet are now available on the Label Noir and Courbet websites, as well as at some of the stores listed on both sites.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/4Label-Noir-x-Courbet-2023-Large.jpeg\"><img class=\"alignnone size-full wp-image-19490\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/4Label-Noir-x-Courbet-2023-Large.jpeg\" alt=\"Label Noir X Courbet\" width=\"853\" height=\"1280\" /></a>\r\n\r\nThe collaboration starts with two things that are important to COURBET: diamonds made in a lab and gold that has been used before. Label Noir brings a technology called a-DLC, which stands for Amorphous Diamond Like Carbon, to the market that combines functional performance and good looks. When put through this process, the gold takes on dark colours that range from anthracite grey to black. This gives COURBET a way to express his creativity that has never been done before. Under the umbrella of innovation and technology, the two houses represent the cutting edge of the traditional worlds of watchmaking and jewellery, giving men a new way to see themselves.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/3Label-Noir-x-Courbet-2023-Large.jpeg\"><img class=\"alignnone size-full wp-image-19491\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/3Label-Noir-x-Courbet-2023-Large.jpeg\" alt=\"3Label Noir x Courbet 2023 Large\" width=\"853\" height=\"1280\" /></a>\r\n\r\nGold and diamonds that have been treated work together in a fascinating contrast of light and dark, and they cover the wrist like a precious tattoo. As the House's symbol, the eclipse stands out against the coldness of the gold. Its CO motif shows how the famous skills of both Label Noir and COURBET have come together. The lines of these unique bracelets are masculine, but they are most of all rock and rebellious. They invite you to show off a new style. The two cord bracelets and two bangles in this original set can be worn alone or as a set. They show a unique way of living between raw nature and dandyism.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/7Label-Noir-x-Courbet-2023-Large.jpeg\"><img class=\"alignnone size-full wp-image-19492\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/7Label-Noir-x-Courbet-2023-Large.jpeg\" alt=\"7Label Noir x Courbet 2023 Large\" width=\"853\" height=\"1280\" /></a>\r\n\r\nFamous for its prowess in the domain of technically advanced coatings and having amassed tremendous success from its collaborations with watch brands and customizations, Label Noir is ready to venture into two new territories further enhancing its expertise in personalization: leather goods and men's <a href=\"https://thehourmarkers.com/featuring/thm-suggests-top-5-high-jewelry-pendant-watches-to-elevate-your-ensemble/\">jewelry</a>.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LN-AIRPODS-PRO-2-CUSTOM-ALLIGATOR-ROSE-Large.jpeg\"><img class=\"alignnone size-full wp-image-19493\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/LN-AIRPODS-PRO-2-CUSTOM-ALLIGATOR-ROSE-Large.jpeg\" alt=\"LN AIRPODS PRO 2 CUSTOM ALLIGATOR ROSE \" width=\"1280\" height=\"1280\" /></a>The initial collection of leather goods accessories designed for tech products marks the inception of this venture. The creative collection is highlighted by customized products for iPhones, AirPods, and MacBooks. Expressing its creativity and passion for design as well as quality, Label Noir has been able to amplify the usability and beauty of these products for an enhanced user experience.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-5.png\"><img class=\"alignnone size-full wp-image-19494\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/unnamed-5.png\" alt=\"Label Noir leather Laptop Sleeve\" width=\"1080\" height=\"1080\" /></a>\r\n\r\nLabel Noir's line-up of leather goods incorporates and draws inspiration from watchmaking aesthetics and metal part treatments. Every single component, from the eyecup to the logo, as well as the <a href=\"https://thehourmarkers.com/featuring/breguet-tradition-quantieme-retrograde-bringing-the-founders-vision-to-life/\">Cloud de Paris</a> or pin inserts, is crafted in polished, matte, or satin finishes, thus paying a rich tribute to authentic watchmaking finishing traditions.\r\n\r\n<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HP-QUILTED-COLLECTION.jpg\"><img class=\"alignnone size-full wp-image-19496\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/HP-QUILTED-COLLECTION.jpg\" alt=\"HP QUILTED COLLECTION\" width=\"1258\" height=\"720\" /></a>\r\nOnly the best French and Italian artisans are entrusted with creating these Label Noir leather masterpieces.\r\nIf you wish to experience the pinnacle of artisanal mastery with a rich traditional allure to upgrade your tech products, then explore the collection of leather goods as well as <a href=\"https://thehourmarkers.com/featuring/le-regulateur-louis-erard-x-label-noir-a-new-collaboration-in-the-land-of-dark-hours/\">Label Noir’s</a> first men's jewelry collaboration with the Parisian jeweler Courbet."
	},
	{
		"title": "A Trio Of Skeletonised Cartier Santos-Dumont Models Unveiled Inspired By Aviation",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nThe interplay of see-through mechanisms and aviation-inspired design elements make the latest Cartier Santos-Dumont watch a true marvel. Launched at Watches and Wonders 2023, this timepiece is a daring rendition of the <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2022-cartier-is-the-masse-mysterieuse-timepiece-a-floating-mystery-2/\">Cartier Santos-Dumont</a> featuring a new in-house movement in a skeletonized appeal. The highlight for this latest release remains to be the aviation-inspired micro-rotor.\r\n\r\nEmbarking on a technical challenge, Cartier designed a totally new in-house 9629 MC automatic skeleton caliber for this timepiece and it took 2 years to develop at their manufacture.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Backdrop Of The Cartier Santos-Dumont</strong></span>\r\n\r\nThe legacy of the original 1904 model designed by Louis Cartier for Brazilian aviator Alberto Santos-Dumont lives on in the latest Santos-Dumont watch, which remains faithful to its elegant design. The latest release for the watch reinterpreted in 2019 boasts a gold or steel case, visible screws, a beaded crown, and a blue cabochon.\r\n\r\n[caption id=\"attachment_19546\" align=\"alignnone\" width=\"1791\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-4-4-e1682681320385.png\"><img class=\"size-full wp-image-19546\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-4-4-e1682681320385.png\" alt=\"The Cartier Santos-Dumont is available in yellow gold with blue lacquer (limited edition), rose gold, and stainless steel\" width=\"1791\" height=\"960\" /></a> The Cartier Santos-Dumont is available in yellow gold with blue lacquer (limited edition), rose gold, and stainless steel[/caption]\r\n\r\nThe watch's skeleton movement pays homage to the pioneering aviator through intricate structural details, while also incorporating an inventive and narrative touch. Notably, a miniaturized functional oscillating weight takes the shape of a replica of the Demoiselle, a pioneering plane designed by the pilot in 1907. This inclusion imbues the symbol with added significance as it appears to soar over a globe.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Daring Santos-Dumont Watch Just Like The Aviator Who Inspired It</strong></span>\r\n\r\nPaying an honest homage to Alberto Santos-Dumont, this watch is both an aesthetic and technical marvel that matches the pioneer’s impressive feats and achievements. <a href=\"https://thehourmarkers.com/in-my-opinion/talk-of-the-town-top-8-watches-making-noise-in-india-right-now/\">Santos-Dumont</a> was a visionary who designed over 22 flying machines, earned numerous patents for his inventions, and dared to embark on experimental flights all by himself. This watch's new in-house micro-rotor 9629 MC automatic skeleton caliber is a testament to this legacy and took the Cartier Manufacture in <a href=\"https://thehourmarkers.com/industry-news/tissot-gives-la-chaux-de-fonds-a-majestic-new-clock/\">La Chaux-de-Fonds</a> almost two years to develop. It comprises 212 intricate components.\r\n\r\n[caption id=\"attachment_19547\" align=\"alignnone\" width=\"2048\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/CARTIER_WATCHES-WONDERS_NEL_2560X996_SANTOS_002.jpg\"><img class=\"size-full wp-image-19547\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/CARTIER_WATCHES-WONDERS_NEL_2560X996_SANTOS_002.jpg\" alt=\"The limited edition lacquered yellow-gold Santos-Dumont\" width=\"2048\" height=\"797\" /></a> The limited edition lacquered yellow-gold Santos-Dumont[/caption]\r\n\r\nCrafted in <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-jaeger-lecoultres-reverso-tribute-duoface-tourbillon-in-pink-gold/\">rose gold</a> and steel, the Santos-Dumont skeleton watch exudes sophistication. A limited edition version in yellow gold takes the collection a notch-up and features navy lacquer, skeleton bridges, and a bezel on the case. The meticulous lacquering process applied by hand results in a truly unique and exquisite finish.\r\n\r\n[caption id=\"attachment_19548\" align=\"alignnone\" width=\"1024\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SQUELETTE_001_24x30-original-Large.jpeg\"><img class=\"size-full wp-image-19548\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/SQUELETTE_001_24x30-original-Large.jpeg\" alt=\"The Cartier Santos-Dumont captures a daring aviation-inspired spirit\" width=\"1024\" height=\"1280\" /></a> The Cartier Santos-Dumont captures a daring aviation-inspired spirit[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>What We Think</strong></span>\r\n\r\nThe Cartier Santos-Dumont has come a long way since its re-introduction in 2019. Featuring a movement designed from the ground up, this timepiece narrates a daring tale of success for the Manufacture and expresses the artisanal watchmaking crafts at <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-cartier-a-refreshingly-slimmer-and-leaner-tank-americaine-offering-an-elegant-upgrade-to-a-timelessly-classic-design/\">Cartier</a> in all their glory."
	},
	{
		"title": "Cartier Tank Américaine Goes Slimmer!",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nEncapsulating the definite traits of a dress watch with the dressiest of all aesthetics, the latest <a href=\"https://thehourmarkers.com/in-conversation/watches-and-wonders-2023-wrap-up-the-battle-of-sizes-and-hidden-gems/\">Cartier Tank Américaine</a> launched at Watches and Wonders 2023 offers a leaner profile and is equipped with an all-new automatic caliber.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Cartier Tank Américaine Story</strong></span>\r\n\r\nThe Tank Américaine watch made its debut in 1989, drawing inspiration from the <a href=\"https://thehourmarkers.com/featuring/watches-wonders-2021-cartier-cloche-de-watches/\">Tank Cintrée</a> timepiece and its curvy profile case. The original Tank Américaine watch also featured the first-ever adjustable strap designed to fit the iconic folding buckle, for which Cartier had filed a patent over 70 years ago, in 1910.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Liberating The Aesthetics With Subtle Yet Impactful Nuances</strong></span>\r\n\r\nFor the 2023 redesign of the collection, the Maison's design studio is enhancing the original design of the watch, emphasizing its curved shape with more refined and sportier lines. The purity of the watch's form is further accentuated by the classic yet legible style of the dial and the seamless integration of the brancards into the extension of the strap.\r\n\r\n[caption id=\"attachment_19552\" align=\"alignnone\" width=\"1071\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-6-3.png\"><img class=\"wp-image-19552 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-6-3-e1682682202262.png\" alt=\"The Cartier Tank Américaine in Rose Gold and Steel\" width=\"1071\" height=\"960\" /></a> The Cartier Tank Américaine in Rose Gold and Steel[/caption]\r\n\r\nThe most noticeable changes come in terms of the size as the new models are thinner and slimmer than the existing line-up, making the watch even more wearable.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Perfect Drape For Your Wrist</strong></span>\r\n\r\nAmong the Cartier novelties at <a href=\"https://thehourmarkers.com/in-conversation/watches-and-wonders-2023-wrap-up-when-the-world-gets-together-for-some-rapid-fire-and-seriously-fun-discussions/\">Watches and Wonders 2023</a>, the revisited Tank Américaine in its redundant size offerings flaunts an irresistibly dressier appeal now in better wearable proportions. The new slimmer cased Tank Américaine is equipped with the new 1899 MC movement and is available in myriad options, including all-gold and steel cases with a leather strap, rose gold and diamonds with a leather strap, or diamond-paved white and <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-patek-philippe-grandmaster-chime-in-white-gold-rose-gold-iterations/\">rose gold</a> with a metal bracelet. The watch's metal bracelet is specially designed for the <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-cartier-a-trio-of-skeletonized-santos-dumont-models-unveiled-with-an-aviation-inspired-design/\">Tank Américaine</a>, with links featuring polished facets that capture and reflect light beautifully.\r\n\r\n[caption id=\"attachment_19555\" align=\"alignnone\" width=\"2304\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-7-2.png\"><img class=\"size-full wp-image-19555\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-7-2.png\" alt=\"The line-up of the new Tank Américaine watches\" width=\"2304\" height=\"960\" /></a> The line-up of the new Tank Américaine watches[/caption]\r\n\r\nAlthough the changes are very little and even hard to notice, they do make a difference on the wrist. What the new Tank Américaine poses as is an even more elegant and dressier timepiece which many wrists will crave to adorn."
	},
	{
		"title": "Rolex Revisits The 70s Spirit With Three New Stone Dials For The Day-Date 36",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nRolex watch novelties for 2023 launched at <a href=\"https://thehourmarkers.com/industry-news/watches-and-wonders-returns-in-september-are-you-ready-for-the-rendezvous-in-shanghai/\">Watches and Wonders</a> were full of surprises, big announcements, and quirky controversies. The new Day-Date 36mm models now earn turquoise combinations along with green adventuring dials speckled with gems and a carnelian variant.\r\n\r\nThe <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-rolex-solving-puzzles-and-having-fun-with-the-oyster-perpetual-day-date-36/\">Rolex Day-Date 36</a> launched at Watches and Wonders 2023 is all about color and finesse as a trio of stone dials for the perennially beloved timepiece has been unveiled. The bang-on-money color combinations make up for a delightfully vibrant execution of one of the favorite offerings in the Rolex catalog.\r\n\r\n[caption id=\"attachment_19571\" align=\"alignnone\" width=\"1007\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128348rbr-0049_2301uf_001-Large.jpeg\"><img class=\"size-full wp-image-19571\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128348rbr-0049_2301uf_001-Large.jpeg\" alt=\"The latest Day-Date 36 models mark the return of the stone dials\" width=\"1007\" height=\"1280\" /></a> The latest Day-Date 36 models mark the return of the stone dials[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Decorative Stones In Shimmering Tones</strong></span>\r\n\r\nEvoking the atmosphere of the Mediterranean coast, the new Day-Date 36 models feature handpicked natural stone-caved dials in a trio of radiant options. The <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-rolex-a-colorful-bubbly-iteration-of-the-oyster-perpetual-joins-the-party-in-three-sizes/\">Oyster Perpetual Day-Date 36</a> features dials studded with diamond-set hour markers and Roman VI and IX.\r\n\r\nConstructed out of a case made up of 18 ct Everose gold, the first variant showcases the green aventurine dial, a stone with a finely crystallized surface. The second timepiece crafted in 18 ct yellow gold features a carnelian dial with an orange hue accentuated by graduating lines or shapes for the addition of depth or dynamic appeal. The last version is offered in an 18 ct white gold case with a turquoise dial naturally textured with veining thus making every watch unique and distinctive. All the timepieces are endowed with 52 brilliant-cut diamonds masterfully set along the bezel of the watch paired with an iconic President bracelet.\r\n\r\n[caption id=\"attachment_19568\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128345rbr-0068_2301uf_001-Large.jpeg\"><img class=\"size-full wp-image-19568\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128345rbr-0068_2301uf_001-Large.jpeg\" alt=\"The new Day-Date 36 models mark the continuation of a Rolex legacy - The popular 1970s stone dials\" width=\"1280\" height=\"960\" /></a> The new Day-Date 36 models mark the continuation of a Rolex legacy - The popular 1970s stone dials[/caption]\r\n\r\nThe latest versions of the Day-Date 36 launched at Watches and Wonders run on the caliber 3255, an example of true innovation and precision watchmaking excellence enabling a display of day and date complications along with the expression of the hours, minutes, and seconds.\r\n\r\nConsistent with the <a href=\"https://thehourmarkers.com/featuring/what-makes-a-rolex-a-rolex/\">Rolex</a> collection, the Oyster Perpetual Day-Date 36 is marked with the Superlative Chronometer certification.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Crowning Interpretation Of Exclusivity</strong></span>\r\n\r\nIntroduced in 1956, the Day-Date wristwatch was a significant innovation well ahead of its time. It was the first calendar watch to display not only the date but also the day of the week, spelled out fully in an arched window at the 12 o'clock position on the dial. The day of the week is available in 26 different languages. The Day-Date range of watches is crafted only in precious metals like 18 ct yellow, white or Everose gold, or 950 platinum.\r\n\r\nThe Day-Date has been a fitting choice of a timepiece for numerous political figures, directors, and visionaries worldwide and is an immediately recognizable watch. This is primarily due to its iconic President bracelet, whose evocative name, coupled with the renowned figures who have worn it, has earned the Day-Date the nickname of the \"presidents' watch.\"\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Watch For All Occasions And Sporty Endeavours</strong></span>\r\n\r\nDespite the dressier appeal, the latest 36 mm Oyster case of the new versions of the Day-Date 36 timepieces showcases a combination of durability and elegance. It is safe in depths up to 100 meters (330 feet).\r\n\r\n[caption id=\"attachment_19572\" align=\"alignnone\" width=\"1034\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128349rbr-0031_2301jva_001_cmjn-Large.jpeg\"><img class=\"wp-image-19572 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128349rbr-0031_2301jva_001_cmjn-Large.jpeg\" alt=\"The watch combined excellent finishing and precision timekeepingwith a sport-lifestyle-inspired 100m water resistance\" width=\"1034\" height=\"1280\" /></a> The watch combined excellent finishing and precision timekeeping with a sport-lifestyle-inspired 100m water resistance[/caption]\r\n\r\nThe Twinlock winding crown, which includes a dual waterproofing mechanism, screws securely against the case, while the crystal is made of sapphire, which is highly resistant to scratches. The date can be easily read through the Cyclops magnifying lens positioned at 3 o'clock. Additionally, the crystal features an anti-reflective coating for enhanced legibility. The waterproof Oyster case offers optimal protection for the watch's remarkably precise caliber 3255.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Uncompromised Timekeeping Precision - The Perpetual Calibre 3255</strong></span>\r\n\r\nThe latest models of the Day-Date 36 timepieces from Rolex feature the caliber 3255 movements. This self-winding mechanical movement, developed and manufactured in-house by Rolex, was introduced in 2015 and fitted on this model for the first time in 2019. The Caliber 3255 movement is a masterpiece of precision timekeeping, delivering exceptional performance, extended power reserve, greater convenience, and reliability.\r\n\r\n[caption id=\"attachment_19570\" align=\"alignnone\" width=\"1034\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128348rbr-0049_2301jva_002_cmjn-Large.jpeg\"><img class=\"size-full wp-image-19570\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128348rbr-0049_2301jva_002_cmjn-Large.jpeg\" alt=\"The new Day-Dates are each equipped with caliber 3255\" width=\"1034\" height=\"1280\" /></a> The new Day-Dates are each equipped with caliber 3255[/caption]\r\n\r\nThis movement incorporates the patented Chronergy escapement technology, which offers high energy efficiency and better reliability. The nickel-phosphorus escapement makes it resistant to strong magnetic fields. The blue Parachrom hairspring, crafted by Rolex in a paramagnetic alloy, provides excellent stability in terms of temperature fluctuations and high resistance to shocks. The Rolex overcoil ensures regularity in any position, while the Rolex-designed Paraflex shock absorbers enhance the movement's shock resistance. The oscillating weight is now fitted with an optimized ball bearing.\r\n\r\nThe caliber 3255 in the Day-Date 36 launched at <a href=\"https://thehourmarkers.com/in-conversation/watches-and-wonders-2023-wrap-up-when-the-world-gets-together-for-some-rapid-fire-and-seriously-fun-discussions/\">Watches and Wonders 2023</a> comes with a self-winding mechanism facilitated by a Perpetual rotor. With its advanced barrel design and efficient escapement, the power reserve of caliber 3255 extends to about 70 hours.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>President Bracelet - A Symbol Of Royalty</strong></span>\r\n\r\nThe latest Day-Date 36 models come fitted with a President bracelet that was originally designed for the launch of the prestigious Oyster Perpetual Day-Date in 1956. This bracelet comprises a unique three-link construction and is crafted exclusively from 18 ct gold or 950 platinum. It remains exclusive to the Day-Date and high-end precious metal Datejust models.\r\n\r\n[caption id=\"attachment_19573\" align=\"alignnone\" width=\"1280\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128349rbr-0031_2301uf_001-Large.jpeg\"><img class=\"size-full wp-image-19573\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/m128349rbr-0031_2301uf_001-Large.jpeg\" alt=\"All the new Day-Date 36 models feature a Presidential bracelet with three-link construction\" width=\"1280\" height=\"1024\" /></a> All the new Day-Date 36 models feature a Presidential bracelet with three-link construction[/caption]\r\n\r\nFor the model with the green aventurine dial, the President bracelet is crafted from 18 ct Everose gold. The carnelian dial variant comes fitted on a bracelet made of 18 ct yellow gold, while the watch with the turquoise dial features an 18 ct white gold bracelet. The bracelet is fitted with a discreet folding Crownclasp that adds to its sophistication. To ensure its durability and flexibility on the wrist, the bracelet comes with Rolex patented ceramic inserts integrated into the links.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Superlative Chronometer Certification</strong></span>\r\n\r\nAs with all Rolex timepieces, the Oyster Perpetual Day-Date 36 bears the Superlative Chronometer certification, which was redefined by the brand in 2015. This designation testifies that each watch produced in the brand's workshops has successfully qualified a series of tests conducted by Rolex itself, following its strict criteria, in addition to the official certification of watch movements by the Swiss Official Chronometer Testing Institute (COSC).\r\n\r\nThe in-house certification tests are performed on the fully assembled watch, after the movement has been encased, ensuring exceptional performance in terms of precision, power reserve, water resistance, and self-winding. A Rolex Superlative Chronometer boasts a precision of approximately −2 /+2 seconds per day, which is significantly better than the rate deviation accepted by COSC for the official certification of the movement alone.\r\n\r\nA green seal that accompanies each Rolex watch represents its Superlative Chronometer status, along with an international five-year warranty.\r\n\r\n[caption id=\"attachment_19574\" align=\"alignnone\" width=\"1912\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-10-1.png\"><img class=\"wp-image-19574 size-full\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Untitled-design-10-1-e1682689453774.png\" alt=\"The three new stone dials are available in carnelian (yellow gold), turquoise (platinum), and green aventurine (Everose gold)\" width=\"1912\" height=\"761\" /></a> The three new stone dials are available in carnelian (yellow gold), turquoise (platinum), and green aventurine (Everose gold)[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Our Takeaway</strong></span>\r\n\r\nRecapturing the classic 1970s vibes and offering a colorful palette for the elegant inspired timepieces, the latest stone dial iterations of the Day-Date 36 launched at Watches and Wonders 2023 offer every desirable nuance to delight a watch enthusiast."
	},
	{
		"title": "A Colourful Party Of Three For The Rolex Oyster Perpetual Bubbly",
		"author": "thmedit",
		"content": "&nbsp;\r\n\r\nFor <a href=\"https://thehourmarkers.com/industry-news/rolexs-oceania-headquarters-inaugurated-at-the-historic-6-story-centenary-hall-building-in-melbourne/\">Rolex</a>, the launches at Watches and Wonders have been all about anniversary timepieces and a playful party spirit. Yes, you heard it right, the brand with the most serious and utilitarian portfolio out there has announced a bunch of quirky and funky timepieces such as the bubbly <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-rolex-solving-puzzles-and-having-fun-with-the-oyster-perpetual-day-date-36/\">Oyster Perpetual</a> ‘Celebration’.\r\n\r\n[caption id=\"attachment_19580\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-1.jpg\"><img class=\"size-full wp-image-19580\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-1.jpg\" alt=\"The Rolex Oyster Perpetual Celebration launched at Watches and Wonders 2023\" width=\"1440\" height=\"1783\" /></a> The Rolex Oyster Perpetual Celebration launched at Watches and Wonders 2023[/caption]\r\n\r\nWith skyrocketing popularity and significantly above-the-retail secondary market pricings, the Stella-inspired OPs launched in 2020 took the watchmaking world by storm. The colorful spirit of these timepieces available in fan-favorite hues carved a delightful reverence for the brand among budding enthusiasts and this year at the <a href=\"https://thehourmarkers.com/featuring/watches-and-wonders-2023-rolex-revisiting-the-70s-spirit-with-three-new-stone-dials-for-the-day-date-36-watches/\">Watches and Wonders 2023</a>, Rolex has come to the party center stage with its Rolex Oyster Perpetual ‘Celebration’ motif available in 31, 36 and 41mm case size variations.\r\n\r\nWe can easily say that Rolex did have a ton of fun this year with such launches at Watches and Wonders 2023!\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Masterpiece Of Sparkling Excellence</strong></span>\r\n\r\nAs a high lord of traditional watchmaking, it is unexpected for Rolex to be out-of-the-box in terms of its designs and choices of color. For a brand whose offerings carry a legacy in terms of aesthetics, materials, and designs tracing back over half a century, surprising the world with a timepiece that features colorful bubbles on its dial face will always be warmly welcomed and appreciated as a playful nod from a manufacturer of ultra-precise utilitarian tool watches.\r\n\r\nPopping with color, vibrant energy, and a youthful appeal, the new lacquered dial of the Oyster Perpetual in 31 mm, 36 mm, and 41 mm is overblown with 51 multi-colored bubbles brewing up from the bottom of the dial. What is worthy to notice is that a choice of turquoise lacquered main canvas is opted to be a balanced backdrop for these bubbles that appear in the hues of the Stella watches.\r\n\r\n[caption id=\"attachment_19581\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-2.jpg\"><img class=\"size-full wp-image-19581\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-2.jpg\" alt=\"The lacquered turquoise dial of the Oyster Perpetual Celebration features an effervescent design of 51 bubbles in 5 colors\" width=\"1440\" height=\"1080\" /></a> The lacquered turquoise dial of the Oyster Perpetual Celebration features an effervescent design of 51 bubbles in 5 colors[/caption]\r\n\r\nThe bubbles outlined in black reunite the five vivid hues: candy pink, turquoise blue, yellow, coral red, and green in one for the ‘Celebration’ timepiece.\r\n\r\nThe new Oyster Perpetual 31 is equipped with caliber 2232, while the Oyster Perpetual 36 and Oyster Perpetual 41 are both fitted with caliber 3230. The timepieces display the essential functions of hours, minutes, and seconds from the movements in these Oyster Perpetual models which bear the Superlative Chronometer certification.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Exceptional Quality Of The Oyster In A Colorful Package</strong></span>\r\n\r\nSince 1926, Rolex has carved an unhindered reputation with the introduction of the world’s first waterproof wristwatch and the new Oyster Perpetual timepieces are direct descendants of the original Oyster watch. Combining the technical nuances such as chronometric precision, a waterproof Oyster case, and self-winding of the movement via a Perpetual rotor, the OPs are not just entry-level Rolex offerings but serious collectibles and investment pieces thanks to their playfully quirky aesthetics that make them desirable. These colors cement the everlasting allure of the <a href=\"https://thehourmarkers.com/watches-and-wonders-geneva-2023/watches-and-wonders-2023-rolex-oyster-perpetual-explorer-unveiled-in-40mm/\">Oyster Perpetual</a> timepieces and by adorning a contemporary appeal, appease the younger collectors.\r\n\r\n[caption id=\"attachment_19583\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-3-e1682773927787.jpg\"><img class=\"size-full wp-image-19583\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-3-e1682773927787.jpg\" alt=\"The Rolex OP Celebration is available in 31, 36, and 41mm size variants\" width=\"1440\" height=\"1449\" /></a> The Rolex OP Celebration is available in 31, 36, and 41mm size variants[/caption]\r\n\r\n<span style=\"font-size: 18pt;\"><strong>The Oyster Case, Symbol Of Waterproofness</strong></span>\r\n\r\nGuaranteeing water resistance to depths of up to 100 meters, the Oyster Perpetual 31, Oyster Perpetual 36, and Oyster Perpetual 41 feature Rolex’s signature Oyster case construction. The case back on the middle case which is constructed out of a solid block of Oystersteel is hermetically screwed down for faultless waterproofing.\r\n\r\nAlong with the Twinlock winding crown which comes fitted with a double waterproofness system, the watch not only is safe for your occasional dip in the pool but garners an all-around wearability appeal for collectors of adventurous lifestyles as well.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Perpetual Calibres 2232 And 3230</strong></span>\r\n\r\nPowering the Oyster Perpetual 31 is the caliber 2232 while the Oyster Perpetual 36 and the Oyster Perpetual 41 feature the caliber 3230. These movements which are fully developed in-house by Rolex come with several undeniably significant technical markers like the Syloxi hairspring in the caliber 2232, the patented Chronergy escapement in the caliver 3230 fitted with a blue Parachrom hairspring as well as the Rolex-designed and patented high-performance Paraflex shock absorbers in both the calibers.\r\n\r\nPerpetual rotor self-winding systems give the calibers 2232 and 3230 autonomies of 55 hours and near weekend-proof 70 hours respectively.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>A Comfy Fit On The Wrist</strong></span>\r\n\r\nThe Oyster Perpetual ‘Celebration’ timepieces in their 31mm, 36mm, and 41mm iterations are born on Oyster bracelets. An original 1930s inception by Rolex, this bracelet technology is highlighted by a unique three-piece link system which is omnipresent across the Oyster Perpetual range.\r\n\r\n[caption id=\"attachment_19584\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-4.jpg\"><img class=\"size-full wp-image-19584\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-4.jpg\" alt=\"The watch features an Oystersteel bracelet with a folding Oysterclasp and Easylink extension\" width=\"1440\" height=\"1163\" /></a> The watch features an Oystersteel bracelet with a folding Oysterclasp and Easylink extension[/caption]\r\n\r\nThe bracelets made out of Oystersteel also feature a folding Oysterclasp and the Easylink comfort extension link which allows the wearer a leverage of 5 mm in adjustment for a snug and comfortable fit.\r\n\r\n<span style=\"font-size: 18pt;\"><strong>Superlative Chronometer Certification</strong></span>\r\n\r\nAs with all Rolex timepieces, the Oyster Perpetual 36 and Oyster Perpetual 41 carry the Superlative Chronometer certification testifying that each watch follows its own strict criteria in quality and precision excellence in addition to the official certification of watch movements by the Swiss Official Chronometer Testing Institute (COSC).\r\n\r\n<span style=\"font-size: 18pt;\"><strong>An Unpredictable Offering</strong></span>\r\n\r\nWhile the Oyster Perpetual Bubble is a genuine fun timepiece with a funky and quirky appeal, it embodies an overpowering appeal reinforced by the fact that <a href=\"https://thehourmarkers.com/history-has-it/rolex-daytona-turns-60-what-led-to-its-success/\">Rolex</a> doesn’t surrender to hype or customer inputs and in the end does what it is meant to do.\r\n\r\n[caption id=\"attachment_19585\" align=\"alignnone\" width=\"1440\"]<a href=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-5.jpg\"><img class=\"size-full wp-image-19585\" src=\"https://thehourmarkers.com/wp-content/uploads/2023/04/Rolex-5.jpg\" alt=\"The new Oyster Perpetual Celebration testifies to the party-nature of Rolex\" width=\"1440\" height=\"1080\" /></a> The new Oyster Perpetual Celebration testifies to the party-nature of Rolex[/caption]\r\n\r\nAs one of the greatest brands in the world, it can afford to be strictly conservative in its product design and development while continuing to surprise us with fun-looking party timepieces like the Oyster Perpetual ‘Celebration’."
	}
]
